[
    {
        "title": "the fool",
        "category": "major arcana",
        "summary": "He inspires courage, for he understands that every day is a chance to open up new areas in your life, and with that comes a mixture of anticipation, wonder, awe and curiosity.",
        "images": [
            {
                "deck": "Rider-Waite-Smith",
                "url": "https://steve-p.org/cards/pix/RWSa-T-00.png"
            }
        ],
        "meaning": {
            "upright": {
                "general":{
                    "keyword":["beginnings", "freedom", "innocence", "originality", "adventure", "idealism", "spontaneity"],
                    "detail":"The Fool card is numbered 0, which is considered to be a number of infinite potential. Consider him a blank slate, for The Fool has yet to develop a clear personality. He is the symbol of innocence - his journey to come will shape his character yet.\n\nTo see the The Fool generally means a beginning of a new journey, one where you will be filled with optimism and freedom from the usual constraints in life. When we meet him, he approaches each day as an adventure, in an almost childish way. He believes that anything can happen in life and there are many opportunities that are lying out there, in the world, waiting to be explored and developed. He leads a simple life, having no worries, and does not seem troubled by the fact that he cannot tell what he will encounter ahead.\n\nTo meet him in a reading can also be seen as a call to the risk-taking part of your own character. He inspires courage, for he understands that every day is a chance to open up new areas in your life, and with that comes a mixture of anticipation, wonder, awe and curiosity. The Fool is there to show that you can never really tell what lies ahead, and you can only greet it with joy."
                },
                "love":{
                    "keyword":["new relationship","fun light romance","adventure in love","open-hearted","innocence","taking risks"],
                    "detail":"When this card shows up in a love tarot reading, get ready to embark on a new adventure. The Fool tarot meaning in love signals that you’ll need to experience new things in order to find the romance that you desire. Be willing to take risks, be bold and expand your vision of the world and you may end up finding love in the most unlikely places. Surprises are in store for you.\n\nSince the Fool represents the start of new journeys, it’s tarot meaning in love can be an indicator of new relationships.\n\nAs with any new relationship, you may fear rejection, but this card indicates that this should not hold you back. When you open yourself up to the world, even in the face of embarassment or rejection, you may find what you are looking for. In love and relationships, the Fool tells us that we should be confident and have faith that all things will work out well. It tells us that instead of giving up, we keep trying, and look at the world with innocence and wonder. The Fool tarot meaning in love encourages open-eyed innocence and positivity."
                },
                "career":{
                    "keyword":["fresh start","career change","new job","opportunities","innovative ideas","courage to take risks"],
                    "detail":"New beginnings are on their way, when the Fool appears in your career tarot reading. If you’ve been looking to start a new career path, change jobs, get a promotion, or even start your own venture, the Fool can be a welcome card to begin your new journey. Even if no new drastic changes are coming your way or planned, this card can feel like a fresh breath of air into old projects. You can be filled with new energy, and new innovative ideas can be put into action now. What is important now is to be very aware of the opportunities that are there, and have the courage to take them when they appear."
                },
                "finances":{
                    "keyword":["spontaneous spending","financial opportunities","adventure in finances","optimistic outlook on money"],
                    "detail":"When it comes to finances, you may be in a period where you are feeling spontaneous and idealistic. All spending now can be for the purpose of adventure and exploration. Want to go on a trip? Or learn a new skill? It can be easy for you to fund these purchases now. There can be a feeling that you will have all that you need, so there’s no need to worry about the bills, and more emphasis on feeling expansive and curious."
                },
                "feelings":{
                    "keyword":["excited","curious","adventurous","optimistic","free-spirited","open-hearted","hopeful","spontaneous"],
                    "detail":"The Fool upright reveals a thrilling sense of excitement and spontaneity in how this person feels about you. They are captivated by your adventurous spirit, seeing endless potential in the unknown journey ahead. A rush of curiosity and hope fills them, as if they’re ready to leap into something new together. Their feelings are fresh, unburdened by past experiences, allowing them to fully embrace the possibilities that await.\n\nThe arrival of The Fool signals your own desire for freedom and exploration. You feel invigorated at the thought of stepping outside your comfort zone or starting a new chapter in life. An openness stirs within you, craving adventure and urging you to trust your instincts: follow where your heart leads without fear or hesitation."
                },
                "actions":{
                    "keyword":["embrace spontaneity","take risks","explore new experiences","trust your instincts","adopt a fresh perspective"],
                    "detail":"When you draw The Fool upright, you’re being asked to embrace spontaneity and adventure. It encourages you to let go of fear and take a leap into the unknown, suggesting that now is the time for exploration and new experiences. Consider trying something you’ve always wanted to do but hesitated about; perhaps signing up for a class or traveling somewhere unfamiliar. This card also urges you to adopt a fresh perspective; view challenges as opportunities rather than obstacles. Allow yourself to be playful and curious, engaging with life in an open-hearted way. Trust your instincts, take risks, and enjoy the journey ahead without overthinking it."
                },
                "yesno":{
                    "keyword":["yes"],
                    "detail":"yes, but"
                }
            },
            "reverse": {
                "general":{
                    "keyword":["recklessness","carelessness","distraction","naivety","foolishness","gullibility","stagnation","dullness"],
                    "detail":"When you land on the reversed Fool in your reading, you can generally find his more negative characteristics being on display. It can mean that you are literally acting like a fool by disregarding the repercussions of your actions. Like the youth depicted in the card, you don’t see how dangerous of a position you find yourself in.\n\nA reversed Fool card can show that you are living in the moment and not planning for the future. The reversed Fool meaning serves as caution that you should be more aware so as not to be taken advantage of. Like the dog in the Rider Waite version, this card is here to alert you on anything that may sound too good to be true."
                },
                "love":{
                    "keyword":["lack of commitment","immature love","risky relationship","rose-tinted glasses","caution in love"],
                    "detail":"When the Fool is reversed in a love tarot reading, this card can signal that your bright-eyed, trusting nature may need to be tempered with a dose of caution. Especially when with new lovers, make sure that everything is what it seems to be. You may now be looking at love with rose-tinted glasses, and unable to see a clear picture of the relationship.\n\nThe reversed Fool tarot meaning in love can also indicate that you or a lover may be a bit too immature right now to handle truly loving relationship."
                },
                "career":{
                    "keyword":["reckless decisions","lack of awareness","feeling stuck in career","careless actions at work","boredom"],
                    "detail":"You may have all the energy in the world, and eagerness to do use that energy, however, you may not quite have the insight to do so without any consequences. Try and be more aware about how your actions affect your colleagues right now, and think before you take action. Other times, the reversed Fool can signal that your current job feels stale and boring, and you may be feeling like it’s time for a change. Sometimes, this indicates that you may feel blocked from actually doing so, or that you need to consider these plans very carefully before making that choice. It may be that there are more dangers than you see right now."
                },
                "finances":{
                    "keyword":["reckless spending","careless financial decisions","impulsive purchases","lack of planning","caution needed"],
                    "detail":"When it comes to your finances, the reversed Fool can suggest financial opportunities, but beware of recklessness. This means that you’ll have to do your research before you lay down your dollars, and there can be consequences that you are not yet aware of. This period can also spell out being careless about your financial decisions; all your impulse purchases are adding up to more than you can actually afford, so you’ll need to take a closer and more realistic look at your bank account."
                },
                "feelings":{
                    "keyword":["hesitant","uncertain","overwhelmed by fears","guarded","questioning feelings","apprehensive about connection"],
                    "detail":"The arrival of the reversed Fool suggests a sense of hesitation and uncertainty in how this person feels about you. They may be feeling overwhelmed by their own fears or insecurities, leading them to hold back from fully embracing the connection. Their feelings are clouded by doubt, making them question whether they should take a leap of faith with you or remain cautious and guarded.\n\nYou might feel that the reversed Fool reflects your own emotions as well, indicating that you could be grappling with similar feelings of apprehension. You could be wrestling with indecision about moving forward in this relationship, fearing potential risks or consequences. This card encourages you to confront these anxieties and consider what truly holds you back from experiencing joy and spontaneity in love."
                },
                "actions":{
                    "keyword":["evaluate your goals","reflect on intentions","seek advice from mentors","take small steps","ground yourself"],
                    "detail":"When you draw The Fool reversed, it’s a signal to take a step back and evaluate your journey. You may be rushing into new experiences without fully considering their implications. Instead, focus on grounding yourself by evaluating your goals and intentions. Take a moment to reflect on what truly excites you and whether those pursuits align with your values. In practical terms, this could mean journaling about your aspirations or seeking advice from trusted mentors. Embrace a more cautious approach; consider taking small steps toward change rather than leaping into the unknown without preparation or thoughtfulness."
                },
                "yesno":{
                    "keyword":["no"],
                    "detail":"no, not yet"
                }
            }
        }
    },
    {
        "title": "The Magician",
        "category": "major arcana",
        "summary": "Remember that you are powerful, create your inner world, and the outer will follow.",
        "images": [
            {
                "deck": "Rider-Waite-Smith",
                "url": "https://steve-p.org/cards/pix/RWSa-T-01.png"
            }
        ],
        "meaning": {
            "upright": {
                "general":{
                    "keyword":["willpower","desire","resourcefulness","skill","ability","concentration","manifestation"],
                    "detail":"The Magician is the representation of pure willpower. With the power of the elements and the suits, he takes the potential innate in the fool and molds it into being with the power of desire. He is the connecting force between heaven and earth, for he understands the meaning behind the words \"as above so below\" - that mind and world are only reflections of one another. Remember that you are powerful, create your inner world, and the outer will follow.\n\n\nWhen you get the Magician in your reading, it might mean that it's time to tap into your full potential without hesitation. It might be in your new job, new business venture, a new love or something else. It shows that the time to take action is now and any signs of holding back would mean missing the opportunity of becoming the best version of yourself. Certain choices will have to be made and these can bring great changes to come. Harness some of the Magician's power to make the world that you desire most."
                },
                "love":{
                    "keyword":["creating opportunities for love","being proactive in love","skill","creativity","desire","determination"],
                    "detail":"As with its general meaning, the Magician tarot meaning in love indicates making things manifest. Skill, creativity, desire and determination will bring success in love. Should you be searching for love, the Magician suggests you take action and create opportunities to meet someone who you desire. Because the Magician in tarot also represents resourcefulness and skill, it is also still important to make sure that no deception or illusions are at work. For both singles and couples, the Magician brings excitement and a desire to experiment."
                },
                "career":{
                    "keyword":["harnessing career opportunities","determination and drive","taking decisive action","pursuing success"],
                    "detail":"There are likely to be opportunities in your midst, and you may be able to harness them if you take decisive action. The Magician is the card of manifestation, meaning should you have the desire and commitment to pursue whatever it is you want in your career, you’re likely to find success. Look behind any successful person, and you’ll likely find intense willpower and drive; this is the root of all ambition. The same goes if you’re looking to start a business; harness that drive, and keep it motivated to manifest your dream career. Sometimes, if this card represents another person, such as a colleague or business partner, you may want to approach with caution, as they may not be everything they appear to be."
                },
                "finances":{
                    "keyword":["financial opportunity","pursuing skills","resourcefulness","creativity","taking action","manifesting wealth"],
                    "detail":"There can be increased financial opportunities available right now, you’ll likely just need to pursue them with gusto. The magician works with many tools to make his will manifest. Try and take a look at the tools you have available; they can be the key for you now. What skills do you have? What abilities are you not putting to use right now? Being creative can yield results."
                },
                "feelings":{
                    "keyword":["excited","inspired","confident","empowered","enthusiastic","drawn to you","potential for growth"],
                    "detail":"The arrival of The Magician ignites a thrilling sense of excitement and potential in how someone feels about you. This person sees you as a wellspring of inspiration, irresistibly drawn to your energy and charisma. They believe that together, you can create something meaningful and transformative. Their feelings brim with enthusiasm, viewing this connection as an opportunity for growth and manifestation.\n\nAs for your own emotions, The Magician reveals that you are empowered and ready to take action. You feel confident in your ability to shape reality and influence the situation at hand. This card urges you to tap into your skills and creativity, reminding you that the power to manifest what you desire in this relationship lies within you."
                },
                "actions":{
                    "keyword":["set clear intentions","take decisive action","harness skills","create opportunities","practice visualization"],
                    "detail":"In the presence of The Magician, you’re encouraged to tap into your unique skills and resources to bring your dreams to life. Embrace a proactive mindset, recognizing that you have the power to create change in your life. Start by setting clear intentions for what you want to achieve, whether it’s a personal project or a career goal. Take tangible steps like enrolling in a course to enhance your abilities or networking with individuals who inspire you. Additionally, practice visualization techniques daily; see yourself succeeding and feel the emotions associated with that success. This is your moment! Take action and make things happen."
                },
                "yesno":{
                    "keyword":["yes"],
                    "detail":"yes"
                }
            },
            "reverse": {
                "general":{
                    "keyword":["manipulation","cunning","trickery","wasted talent","illusion","deception","self-doubt","powerlessness"],
                    "detail":"When you obtain the Magician reversed, it might mean its time for you to implement some changes. While right side up, the Magician represents true power, the reversed Magician is a master of illusion. The magic that he performs is one of deception and trickery. You may be lured in by the showmanship of his arts, but behind that there may be an intention to manipulate for selfish gain. Getting this card might mean that there is someone who pretends to have your best interests at hand when the opposite is true.\n\nConsider whether this reversed the magician is in your circle, or perhaps might also represent your current state of emotions. It may mean you may become obsessed with power and that might lead to wrong, reckless decisions that will lead to your eventual downfall."
                },
                "love":{
                    "keyword":["romantic illusion","romantic trickery","low willpower for love","insecurity in relationships","feeling misled"],
                    "detail":"In reverse, the Magician tarot meaning in love can signal that not everything may be what it seems. When it comes to new relationships, you may want to make sure you truly know your new lover. Even if he or she seems perfect, this could be an illusion or performance. Alternatively, the reversed Magician in love can indicate that your low confidence or a lack of willpower, or an inability to manifest your relationships, creating insecurity when it comes to romance and love."
                },
                "career":{
                    "keyword":["wasted talent","manipulation","workplace deception","missed opportunities","lack of confidence","fear of risks"],
                    "detail":"Are you really putting all of your talents to use right now? Are there any skills that your current career trajectory is ignoring? There are likely lots of opportunities for you to advance, if you were to really use your true potential. You may already feel this, but perhaps are too afraid to take the plunge, as it can be a risky move. You’ll need to take a closer look at what the real risks are, and understand whether your fears are truly grounded in reality, or whether they stem from a different source. Sometimes this card can also indicate that the people in your workplace may not be completely honest, or may have hidden agendas. If your gut instinct is telling you this, trust it; be wary about how much you share around them."
                },
                "finances":{
                    "keyword":["missed financial opportunity","not using skills for financial gain","wasted talent","lack of willpower"],
                    "detail":"If your finances aren’t quite what you hoped they would be right now, it may be that you’re not putting your best foot forward. You may have energy or talents that are being wasted, and you will only need to grow your confidence to put yourself out there. You may lack the willpower to transform your talents into money. Remain cautious around others, when it comes to sharing details about your financial situation."
                },
                "feelings":{
                    "keyword":["confusion","manipulation","uncertainty","frustration","doubt","feeling misled","lack of confidence"],
                    "detail":"The appearance of the reversed The Magician points to a sense of confusion or manipulation on their part. They may feel uncertain and lack confidence in your connection, possibly perceiving that things are not as they seem. This card indicates they might be questioning your intentions or feeling misled, leading to feelings of frustration or doubt.\n\nIn terms of your own emotions, the reversed Magician reflects a struggle with self-doubt and a sense of powerlessness. You could be feeling disconnected from your own abilities and unsure about how to manifest what you truly desire. It’s essential to recognize these feelings and reclaim your personal power by focusing on clarity and intention in both yourself and your relationships."
                },
                "actions":{
                    "keyword":["reassess goals","focus on clarity","simplify plans","engage in self- reflection","seek guidance from mentors"],
                    "detail":"When you draw the reversed The Magician, it suggests that you may be feeling disconnected from your personal power and potential. It’s time to reassess how you approach your goals and intentions. Instead of trying to force outcomes, focus on clarity and authenticity in your actions. Consider simplifying your plans; break them down into manageable steps rather than overwhelming yourself with grand ideas. Engage in self-reflection by journaling or meditating to uncover what truly drives you. Seek guidance from mentors or trusted friends who can provide fresh perspectives, helping you realign with your true capabilities and take meaningful action toward your aspirations."
                },
                "yesno":{
                    "keyword":["no"],
                    "detail":"no"
                }
            }
        }
    },
    {
        "title": "The High Priestess",
        "category": "major arcana",
        "summary":"Her appearance in a reading can signify that it is time for you to listen to your intuition rather than prioritizing your intellect and conscious mind.",
        "images": [
            {
                "deck": "Rider-Waite-Smith",
                "url": "https://steve-p.org/cards/pix/RWSa-T-02.png"
            }
        ],
        "meaning": {
            "upright": {
                "general":{
                    "keyword":["unconscious","intuition","mystery","spirituality","higher power","inner voice","self-reflection","meditation"],
                    "detail":"The meaning of the High Priestess is related with inner knowledge. Her appearance in a reading can signify that it is time for you to listen to your intuition rather than prioritizing your intellect and conscious mind. When the High Priestess shows up it can depict an archetype known as the divine feminine - the mysterious female that understands and holds the answers to the deep unknowns; religion, self, nature. She represents someone that is intuitive, and beginning to open to her or his spirituality. Meditation, prayer and new spiritual work is indicated.\n\nThe card itself shows a night-time scene, meaning that the world in which she protects and guards is one that may at first seem frightening, but has the potential to lead us into the growth of the self. When she appears in a reading, she is calling to you to listen to her message, and follow her into your own depths. There is searching within yourself to be done for the answers that you seek. The answers to the questions you have are within, not without."
                },
                "love":{
                    "keyword":["patience in love","trust intuition","hidden emotions","increasing intimacy","honesty in relationships"],
                    "detail":"The High Priestess in a love tarot reading can signal almost imperceptible and unconscious changes in one's emotional state. A calm surface can hide intense emotions, and even seemingly simple dates can turn into raging passions. The High Priestess tarot love meaning suggests that one needs patience, and trust for your intuition. Be honest with others and yourself, and let what is hidden come to the surface.\n\nIn a relationship, the High Priestess shows increasing intimacy and openness. In a love tarot reading, this card signals that honesty is essential to making your relationship as strong as it can be."
                },
                "career":{
                    "keyword":["education","creative inspiration","guide","mentor","use instincts","intuition in decision-making"],
                    "detail":"When it comes to your career, the High Priestess may signal a period of education or higher learning. You may be returning to school for training. If you’re in a creative field, this card also can suggest new inspiration coming into your work. When making big choices about your future career or projects, the High Priestess also suggests relying on your gut instincts. There’s likely a lot of information there that will aid you. At times, this card can also signal the appearance of a mentor or guide that can help you progress further in your work."
                },
                "finances":{
                    "keyword":["keeping finances private","trusting intuition in financial decisions","assessing opportunities carefully"],
                    "detail":"Since the High Priestess is related to mystery and the unknown, be wary of discussing your finances with others. This card suggests keeping your financial situation hidden. Alternatively, if you’re being presented with the opportunity to put your finances into use, your intuition will know whether this is a good choice or not. Take some time to probe your feelings; if there are red-flags, something won’t feel right. Listen to those feelings."
                },
                "feelings":{
                    "keyword":["intuitive connection","captivated by mystery","deep emotions","cautious attraction","inner reflection"],
                    "detail":"Drawing The High Priestess invites you to delve into a deep, intuitive connection. This person is captivated by your mysterious aura and senses that there’s much more beneath the surface. Their feelings are instinctual rather than logical; they feel an undeniable pull towards you but remain cautious, wanting to understand the depths of your character before fully committing.\n\nThis card signals a time for self-reflection on your emotions. You may feel compelled to explore your inner self while wrestling with uncertainty about this relationship. Trusting your intuition will illuminate these complex feelings, guiding you as you uncover what truly resonates within and navigate this emotional landscape together."
                },
                "actions":{
                    "keyword":["listen to intuition","meditate regularly","journal thoughts","explore creativity","seek spiritual knowledge"],
                    "detail":"The arrival of The High Priestess suggests that now is the time to turn inward and trust your intuition. You should focus on deepening your self-awareness and exploring your inner wisdom. This may involve setting aside quiet moments for meditation or journaling, allowing you to connect with your subconscious thoughts. Consider engaging in activities that foster creativity, such as painting or writing, which can help unlock hidden insights. Additionally, seek knowledge through reading spiritual texts or attending workshops that resonate with you. Embrace this period of reflection; it will guide you toward clarity and understanding in both personal and professional aspects of life."
                },
                "yesno":{
                    "keyword":["maybe"],
                    "detail":"maybe"
                }
            },
            "reverse": {
                "general":{
                    "keyword":["repressed intuition","hidden motives","superficiality","confusion","cognitive dissonance","self-doubt"],
                    "detail":"When it comes to the High Priestess reversed, it can mean that you are finding it difficult to listen to your intuition. It is time for you to meditate and try new approach, for at this moment, the rational approach will not work. Something has been telling you to follow your gut, but you may be ignoring the call. There is a lot of confusion around you, and your actions may feel contrary to what you know is right. You must never be afraid to ask questions of yourself that may illuminate a new path forward for you, one that is more authentic to your inner self and your individual values."
                },
                "love":{
                    "keyword":["ignoring intuition in romance","hiding true self with lover","confusion in feelings","lack of honesty"],
                    "detail":"The High Priestess is the guardian of your intuition, indicating that it can be a powerful indicator that you will need to trust your feelings when it comes to love and romance. Difficulties can develop when you ignore your intuition and follow only your conscious mind. The High Priestess love meaning can also signal that you must be careful to be truly honest. Avoid taking action or saying words to simply please your lover. This leads to nothing but resentment."
                },
                "career":{
                    "keyword":["isolated at work","lacking information","ignoring intuition","feeling disconnected","hidden agendas"],
                    "detail":"You may not have all the information when it comes to your work situation right now. Have people kept you in the dark? Because of this, you can feel alone and perhaps out of touch with your coworkers. It may also be that when it comes to making career decisions, you’re not listening to your intuition. Are you choosing to trust a business associate despite a gut feeling that they don’t have the best intentions for you? Are you staying in a job you despise despite your intuition telling you that this one isn’t meant for you? This card can also suggest a colleague who has hidden agendas; be wary of others. A warm demeanor may hide danger."
                },
                "finances":{
                    "keyword":["lack of information","missing details","poor financial decisions","confusion about finances","hidden motives"],
                    "detail":"Are you in the process of signing contracts, taking loans, getting a mortgage, or investing in something? There may be some details that you’re missing. The High Priestess reversed in a financial tarot meaning can suggest that you don’t quite have all the information you need to make a proper, educated decision. Make sure you have someone you can trust, and that can give you all the facts."
                },
                "feelings":{
                    "keyword":["confusion","mistrust","mixed emotions","self-doubt","hidden motives","lack of clarity","repressed feelings"],
                    "detail":"The arrival of the reversed High Priestess suggests that this person is grappling with confusion and uncertainty. They may feel disconnected from their intuition regarding you, leading to mixed emotions or even mistrust. Their feelings might be clouded by secrets or misunderstandings, making it difficult for them to fully embrace what they truly want.\n\nWith regard to your own feelings, the reversed High Priestess indicates that you could be experiencing self-doubt or a lack of clarity within yourself. You might find it challenging to trust your instincts or understand your emotional landscape right now. This card encourages you to delve deeper into your inner world and confront any fears or uncertainties that are holding you back from achieving emotional fulfillment."
                },
                "actions":{
                    "keyword":["seek clarity","confront inner truths","journal thoughts","meditate for insight","reassess secrets","embrace vulnerability"],
                    "detail":"The arrival of the High Priestess reversed suggests that you should take action by seeking clarity and confronting your inner truths. This card indicates a time to step away from distractions and tune into your intuition, which may have been clouded by external influences. Focus on self-reflection; journal your thoughts or meditate to uncover hidden feelings. It’s also essential to reassess any secrets or unspoken issues in your life, whether they are personal dilemmas or unresolved conflicts with others. By embracing vulnerability and honesty, you can create space for deeper understanding and growth, leading you toward more authentic connections and decisions."
                },
                "yesno":{
                    "keyword":["maybe"],
                    "detail":"maybe"
                }
            }
        }
    },
    {
        "title": "The Empress",
        "category": "major arcana",
        "summary": "The Empress is associated with fertility, expression, creativity and nurturing among many other aspects.",
        "images": [
            {
                "deck": "Rider-Waite-Smith",
                "url": "https://steve-p.org/cards/pix/RWSa-T-03.png"
            }
        ],
        "meaning": {
            "upright": {
                "general":{
                    "keyword":["divine feminine","sensuality","fertility","nurturing","creativity","beauty","abundance","nature"],
                    "detail":"The Empress shows us how deeply we are embedded to our femininity. Femininity could be associated with fertility, expression, creativity and nurturing among many other aspects. It therefore calls you to connect with beauty and bring happiness to your life. Understand yourself and get in touch with your sensuality so that you can attract life circumstances to bring happiness and joy. She is a signal that be kind to yourself, to take care of yourself.\n\nThe Empress is also a strong indication of pregnancy and motherhood. You can look for other cards to confirm if this is truly pregnancy, or rather just an indication of a motherly, nurturing and caring attitude. The Empress card could also mean the birth of a new idea, business or project on your life. Owing to the good fortune that surrounds this card, you can be sure that such situations and projects would end successfully in your life. Discover and bring forth those ideas that have been clinging to you and make sure that you devote yourself towards accomplishing them. This card is a sign that they are going to be successful, and well taken care of. The Empress, as the archetype of the mother earth, also encourages you to spend time interacting with nature, the mother of all of us."
                },
                "love":{
                    "keyword":["nurturing","supportive lover","sensual committed relationship","stable love","emotional fulfillment"],
                    "detail":"The Empress tarot love meaning stems from the element of earth. The person represented by this card can be loving, nurturing and caring, as has financial security or appreciative of beautiful, comforting things. Sometimes, the Empress can point to love and work coming together, either with a coworker, or perhaps a new business venture.\n\nWhen it comes to relationships, this card also heralds a stable, serious and committed relationship. Because the card also represents motherhood, sometimes it can also signal marriage or pregnancy, or at least a new family, in whatever form that means for you."
                },
                "career":{
                    "keyword":["nurturing colleagues","creative work","supportive environment","workplace harmony","passion for projects"],
                    "detail":"Your career right now may be enjoying a boost right now. You may be more creative and passionate than usual, and putting all your ideas to work in your projects. Since the Empress is related to nourishment and nurturing, it may also suggest that you’re feeling particularly nurturing and generous when it comes to your workplace as well. You may be working on making a more harmonious and welcoming office, whether that means being supportive of coworkers, or putting a new coat of paint at your home office. Having the environment to do your best can certainly give you even more momentum. Sometimes, this card can also point to another person in your workplace that has these qualities."
                },
                "finances":{
                    "keyword":["material comfort","financial stability","abundance","generosity","sharing wealth","nurturing finances"],
                    "detail":"The Empress is abundant both creatively and materially, so this card can point to a comfortable financial situation. You may also be feeling very generous with your money now, wanting to nourish your friends and family with your abundance and good luck. It is certainly a good time to share what you have."
                },
                "feelings":{
                    "keyword":["warmth","affection","admiration","nurturing","abundance","comfort","inspiration","desire for growth","love"],
                    "detail":"When you draw The Empress, someone is overflowing with warmth and affection for you. They see you as nurturing and abundant, drawn to your caring nature. You are a source of comfort and inspiration in their life, bringing beauty wherever you go. Their feelings are rooted in admiration and a desire for growth together, hinting at a future filled with love and harmony.\n\nThe arrival of The Empress signals a surge of creativity and emotional fulfillment in your life. You may feel more connected to your desires and instincts than ever before, fully embracing the joy that comes from self-love. This card urges you to nurture yourself while also recognizing the blossoming relationships around you."
                },
                "actions":{
                    "keyword":["nurture yourself","embrace creativity","connect with nature","foster relationships","practice self-care"],
                    "detail":"Guided by The Empress, you are encouraged to embrace nurturing actions and creativity in your life. This card encourages you to cultivate a sense of abundance, both within yourself and in your surroundings. Focus on self-care by engaging in activities that bring you joy, such as gardening or cooking nourishing meals. Consider fostering relationships by reaching out to loved ones or creating a supportive community around you. Additionally, channel your creative energy into artistic projects or hobbies that inspire you. By embracing these nurturing actions, you'll not only enhance your well-being but also attract positivity and growth into your life."
                },
                "yesno":{
                    "keyword":["yes"],
                    "detail":"yes"
                }
            },
            "reverse": {
                "general":{
                    "keyword":["insecurity","overbearing","negligence","smothering","lack of growth","lack of progress","emotional distance"],
                    "detail":"The Empress reversed indicates that you have lost too much of your own willpower and strength because you have started placing too much effort and concern to other people’s affairs. While the Empress's nature is of showering her loved ones with attention and care, this can sometimes go overboard. You might be neglecting your own needs, or even smothering the ones you love with your well-intentioned actions.\n\nIn a role reversal, perhaps a reversed Empress is finding her way into your life; it could also mean that you are relying on others to take care of you, and make decisions for you. You need to work towards removing this influence on your life, and build confidence in your own actions. Always try as much as you can to ensure that you solve matters on your own."
                },
                "love":{
                    "keyword":["lack of self worth","jealous lover","clingy partner","emotional distance","lack of growth in love"],
                    "detail":"The reversed Empress love tarot meaning can represent a partner is too smothering, controlling or alternatively, unable to express their feelings. The card can also signal that one's self-worth may need a boost. Without feeling worthy of being loved, it doesn't matter who you are with, you may have difficulties maintaining that relationship.\n\nIf you're in a relationship, the Empress in a love tarot meaning can be encouragement to spend some quality time together, and care for eachother. Give yourself a treat by having a date at a restaurant, or a walk holding hands. These moments will bring you two closer together."
                },
                "career":{
                    "keyword":["insecurity","overbearing","negligence","smothering","lack of growth","feeling unfulfilled at work","stagnation"],
                    "detail":"Your career may be feeling stale, tedious and unfulfilling right now. It may feel that you’re making little progress when it comes to developing your skills and abilities. The work is monotonous, and perhaps you’ve already mastered what you can do in this position. You may feel that others don’t appreciate the work you’re doing, further adding to your frustration. At times, this card also can point to a feeling of being insecure when it comes to your career. This may also be causing the other problems you’re experiencing. It’s important to take the time now and sort out which of these are problems that require an external change, like switching jobs, versus an internal one, like developing better confidence and communication skills."
                },
                "finances":{
                    "keyword":["insecurity about finances","feeling unstable despite comfort","self-doubt in financial decisions"],
                    "detail":"Since the Empress is generally a great card to have with finances, even in the reversed position, she still signals a comfortable amount of financial stability. However, in reverse, she may suggest that despite you having enough, you may still feel unstable. Sometimes, this can come from growing up in poverty, or is just the nature of being self-employed. You may have to do some internal work to understand why this is so; and what you can do to change it. Continue to be responsible with your finances, and it’s likely you’ll be fine."
                },
                "feelings":{
                    "keyword":["insecurity","emotional distance","self- doubt","lack of confidence","stifled affection","feeling overwhelmed"],
                    "detail":"When you pull the reversed Empress in response to how someone feels about you, it suggests that this person may be experiencing feelings of insecurity or emotional distance. They might struggle with nurturing their connection with you, feeling overwhelmed by self-doubt or a lack of confidence in your relationship. Their affection could feel stifled, as if they are unable to express themselves fully due to fears of inadequacy.\n\nIn the realm of your own feelings, the reversed Empress indicates a sense of disconnection from your own emotions and desires. You may find yourself grappling with issues related to self-worth or creativity, leading to frustration and dissatisfaction within yourself. This card encourages you to explore what truly nurtures your spirit and seek ways to reconnect with your inner abundance and joy."
                },
                "actions":{
                    "keyword":["reassess priorities","practice self-care","set boundaries","engage in creative activities","evaluate relationships"],
                    "detail":"In the presence of The Empress reversed, you’re encouraged to turn your attention inward and reassess what truly matters. This card indicates a need to reconnect with your inner self, so take time for self-care and reflection. Consider journaling about your feelings or engaging in creative activities that bring you joy. It may also be beneficial to evaluate the relationships in your life; are they supportive or draining? Set boundaries where necessary, allowing space for growth. By prioritizing your well-being and fostering a healthier environment around you, you'll cultivate the abundance and fulfillment that The Empress embodies when upright."
                },
                "yesno":{
                    "keyword":["no"],
                    "detail":"no"
                }
            }
        }
    },
    {
        "title": "The Emperor",
        "category": "major arcana",
        "summary":"He is a symbol of the masculine principle - the paternal figure in life that gives structure, creates rules and systems, and imparts knowledge.",
        "images": [
            {
                "deck": "Rider-Waite-Smith",
                "url": "https://steve-p.org/cards/pix/RWSa-T-04.png"
            }
        ],
        "meaning": {
            "upright": {
                "general":{
                    "keyword":["stability","structure","protection","authority","control","practicality","focus","discipline"],
                    "detail":"It’s all about control when it comes to the Emperor, for this card means authority, regulation, organization and a fatherliness. The Emperor represents a strategic thinker who sets out plans that he must see through. He is a symbol of the masculine principle - the paternal figure in life that gives structure, creates rules and systems, and imparts knowledge. Where the Empress's desire for their kingdom is to create happiness, the emperor desires to foster honor and discipline. He guides with a firm hand, following the calling of the crown above all else. Though he is a ruler, he understands that to reign is also to serve - thus he acts rationally and according to what is for the greater good of the kingdom.\n\n\nTo see him in a reading presents a chance to grow in terms of the goals that you have set for yourself. It presents a successful future as long as you pursue your goals similar to the fashion that the Emperor does, methodically, and strategically.\n\nWhen you see him in a reading, a possible interpretation is that you could be put in charge of something important. It could be a position at work or in any kind of organization or institution that desperately needs order and a clear decisive mind. You may be called to act in the place of the Emperor, using his wisdom to bring clarity to the project."
                },
                "love":{
                    "keyword":["traditional relationship","logic in love","unexpressed emotions","structure in romance","disciplined approach"],
                    "detail":"Although the Emperor is a very serious man, without any real sense of romance, its appearance in a love tarot reading can still be beneficial. The Emperor tarot love meaning asks us to bring common sense, structure, discipline and logic to relationships and romance. Relationships around this tarot card may be rather traditional, and perhaps stifling if not handled too carefully.\n\nAs a person, the Emperor represents someone older and well-established, that may also have a hard time expressing their feelings. Sometimes, this card however, can also symbolize a person driven by ego, who is domineering and bullying, and unable to empathize with others."
                },
                "career":{
                    "keyword":["creating processes","structure","discipline","routine","mentor","hard work","concentration","organized approach"],
                    "detail":"Your career may be flourishing due to your hard work, concentration and organized approach. The Emperor calls on you to be disciplined, efficient and persistent when it comes to getting what you want out of your job, or job search. If your office, or your work process is a bit chaotic or frustrating right now, it may be helpful for you to step up and introduce new methodologies or structures that can help you and your teammates collaborate more efficiently. This card can also point to having a more senior colleague or boss that can provide you with support and advice in your career."
                },
                "finances":{
                    "keyword":["control","discipline","responsibility","budgeting","financial stability","strategic planning","organization"],
                    "detail":"When it comes to your finances, the Emperor signals the need to be controlled, disciplined and responsible with your money. Make sure that you have a clear understanding of where your money is going; put together a budget, make sure you stick to it, and check in every month or so. So long as you can keep it up, you’ll likely be in a good financial position."
                },
                "feelings":{
                    "keyword":["stability","authority","admiration","respect","security","grounded feelings","long-term vision","reliability"],
                    "detail":"The Emperor upright reveals a strong sense of stability and authority in how this person feels about you. They see you as a powerful figure, embodying leadership and reliability. Your presence makes them feel secure, fostering admiration and respect for your ability to take charge. Their feelings are grounded; they value structure and may even envision a long-term connection with you.\n\nIn terms of your own emotions, The Emperor indicates that you're striving for control over your emotional landscape. You might feel empowered yet cautious, eager to establish boundaries while seeking order in your life. This card urges you to embrace your inner strength and assertiveness as you navigate these complex feelings, guiding yourself toward clarity and confidence in what lies ahead."
                },
                "actions":{
                    "keyword":["seize control","set clear goals","establish boundaries","create plans","adopt structured routines","seek mentorship"],
                    "detail":"With The Emperor at the forefront, now is your moment to seize control of your life with unwavering confidence and authority. Embrace a leadership role in your personal or professional sphere, setting clear goals and boundaries. This card encourages you to adopt a structured approach; create a detailed plan for your aspirations, whether it’s advancing in your career or improving relationships. Consider establishing routines that foster discipline and stability. Additionally, seek mentorship or guidance from someone you respect, as their wisdom can help solidify your path forward. By embodying decisiveness and responsibility, you will cultivate an environment where success can thrive."
                },
                "yesno":{
                    "keyword":["maybe"],
                    "detail":"maybe"
                }
            },
            "reverse": {
                "general":{
                    "keyword":["tyranny","chaos","insecurity","lack of control","rigidity","power struggle","recklessness","overbearing"],
                    "detail":"The Emperor reversed is a sign of abused authoritative power. In your social life, it can manifest in the overreach of power from a father figure or a possessive partner. In career readings, it could be coming from a superior. It presents a man who wants to take control of your actions and makes you feel powerless. It could also be that you are playing the part of a weak ruler, hatching a plan to avoid the tasks that come with having responsibility. Perhaps you aspire for a career that is more flexible than one that is governed by strict rules.\n\nLack of self-control and inability to handle situations can be represented by the Emperor on a personal level. When he is reversed, the structures, rules and systems that he creates are no longer working. His desire to inspire higher principles in his kingdom have turned to ruthlessness, tyranny and rigidity. He seeks to dominate, forgetting his call from the crown to do what is best for his people, fearing only for his loss of control and thus creating suffering."
                },
                "love":{
                    "keyword":["power struggle","overbearing partner","emotional disconnection","competitiveness","power issues"],
                    "detail":"The reversed Emperor tarot love meaning can signal some kind of power struggle or a fight for dominance when it comes to love and relationships. Instead of coming together with your different ideas, there may be competitiveness and a desire to just be right.\n\nThis card can also signal an overbearing partner, whether it's you or your other half. Be careful that you don't give up too much of your personal power, or repress who you are in order to be in this relationship. Alternatively, this card can also signal difficulty emotionally connecting in your relationship or potential relationships."
                },
                "career":{
                    "keyword":["tyrant","domineering","rigidity","lack of focus","poor leadership","frustration at work","feeling powerless"],
                    "detail":"Without focus or discipline, your work may start to falter. If you’ve been lacking these qualities in the workplace, you may notice that it is taking a toll on your projects. Sometimes, this card can also suggest rigidity and bureaucracy in your work environment. This may stifle your sense of creativity and motivation, since the processes needed to do anything have been tedious and frustrating. At worst, the reversed Emperor can point towards a senior employee or boss that rules the workplace like a tyrant. Should this be your situation, it may be better to start looking for employment elsewhere."
                },
                "finances":{
                    "keyword":["lack of control","out of control finances","lack of discipline","reckless spending","financial instability"],
                    "detail":"You may feel like your finances are out of your control right now. The reversed Emperor can suggest one’s inability to properly deal with one’s financial situation. Sometimes, it can also suggest lack of discipline when it comes to spending. If the former is your case, you may want to find a professional that can help you. If the latter applies instead, you’ll really need to take a closer look at what you’re earning versus what you’re spending, and learn to cut things out."
                },
                "feelings":{
                    "keyword":["insecure","frustrated","confused","self- doubt","challenged authority","hesitant to express feelings"],
                    "detail":"When you draw the Emperor reversed in a reading about someone’s feelings for you, it suggests that this person may be feeling insecure or out of control. They might perceive you as a challenge to their authority or stability, leading to frustration and confusion. Their emotions could be clouded by self-doubt, making them hesitant to fully express how they feel about you.\n\nAs it relates to your own feelings, the reversed Emperor indicates a struggle with personal power and direction. You may find yourself questioning your own decisions and feeling uncertain about what you truly want. This card encourages introspection; take time to regain clarity and confidence in your emotional landscape so that you can move forward with purpose."
                },
                "actions":{
                    "keyword":["let go of rigid structure","embrace flexibility","delegate responsibility","seek collaboration","create work-life balance"],
                    "detail":"Guided by The Emperor reversed, it’s time to rethink how you handle authority and control in your life. This card encourages you to let go of rigid structures and embrace flexibility. Now is the time to question outdated beliefs or methods that no longer serve you. Consider delegating responsibilities or seeking collaboration rather than trying to manage everything alone. In practical terms, take a moment to evaluate your work-life balance; perhaps it's time for a break or a change in routine. Engage with others openly, allowing their input to shape decisions, fostering an environment where creativity can thrive without constraints."
                },
                "yesno":{
                    "keyword":["maybe"],
                    "detail":"maybe"
                }
            }
        }
    },
    {
        "title": "The Hierophant",
        "category": "major arcana",
        "summary": "The Hierophant card suggests that it’s better for you to follow social structures which are established and have their own traditions",
        "images": [
            {
                "deck": "Rider-Waite-Smith",
                "url": "https://steve-p.org/cards/pix/RWSa-T-05.png"
            }
        ],
        "meaning": {
            "upright": {
                "general":{
                    "keyword":["tradition","education","conformity","social groups","beliefs","knowledge","stability"],
                    "detail":"To see the Hierophant in a reading is to embrace the conventional, for it suggests that you have a certain desire to actually follow a process which has been well established. It also suggests that you want to stay within certain conventional bounds of what could be considered an orthodox approach. So, instead of being innovative, you will be adapting to certain beliefs and systems which are already put in place and are existing.\n\nThe Hierophant card suggests that it’s better for you to follow social structures which are established and have their own traditions. You might be involved in certain ceremonies, rituals or other religious trappings, for instance. When it comes to tarot readings, this particular card is most commonly representative of institutions as well as their core values. This is a sign that shows that you need to conform to the already existing set of rules and situations which are fixed already."
                },
                "love":{
                    "keyword":["safe partners","traditional love","spiritual connection","community approval","avoiding taboo"],
                    "detail":"When it comes to relationship tarot readings, the Hierophant's upright love meaning can point to the effects of conventional religion on love and choosing partners. You could be drawn to partners that are safe, traditional, and respected by your community, and avoid partners that are considered \"taboo\". The Hierophant love meaning in tarot can also represent the more spiritual aspects of love, and a reminder that our partners should be treated morally, and lovingly. Sometimes, this card can also indicate marriage.\n\nRelationships affected by the Hierophant card are usually traditional, conventional and socially approved. Partners are likely to share a system of beliefs."
                },
                "career":{
                    "keyword":["success in work groups","education","teamwork","mentor","collaboration","traditional career paths"],
                    "detail":"With the Hierophant, you’ll find success from working with others right now. This can sometimes mean also choosing to not rock the boat, and staying on the tried and true path. With so many variables when it comes to work, it may be better to stay safe for now. This card can also signal that group cohesion rather than individuality can be more important at the moment. Sometimes, the Hierophant can also signify a more senior mentor that can be a helpful aid in you progressing through your career. The card is also representative of education, meaning that a time of learning, whether through a school or vocational training, can be helpful for you."
                },
                "finances":{
                    "keyword":["keeping your money safe","traditional financial institutions","avoiding risky investments","established methods"],
                    "detail":"When it comes to your finances, the Hierophant can suggest that your money should remain safe in traditional, established institutions. Novel ways of making money, whether it’s a side hustle you don’t really understand, or new financial products, may cause problems for you; avoid gambling with your money."
                },
                "feelings":{
                    "keyword":["respect","admiration","desire for commitment","appreciation of wisdom","seeking stability","valuing tradition"],
                    "detail":"The Hierophant upright reveals a profound respect and admiration for you. This person values tradition and stability, viewing your connection as meaningful and aligned with their beliefs. They likely feel a strong desire for commitment or guidance from you, appreciating the wisdom and support you bring into their life.\n\nIn terms of your own feelings, The Hierophant indicates that you're seeking deeper understanding and spiritual growth within this relationship. You may feel drawn to explore shared values or traditions together, eager to establish a solid foundation based on mutual respect. Embrace the lessons learned through this connection while remaining open to love's transformative power."
                },
                "actions":{
                    "keyword":["seek guidance","embrace tradition","join community","reflect on beliefs","engage in learning","explore spirituality"],
                    "detail":"As The Hierophant emerges, it’s clear that now is the time to seek guidance and embrace tradition. You should immerse yourself in learning, whether through formal education or mentorship. Consider joining a group or community that aligns with your values, as this will provide support and shared wisdom. Reflect on your beliefs and how they shape your actions; it may be beneficial to explore spiritual practices or rituals that resonate with you. Engage in conversations with those who inspire you, allowing their insights to broaden your perspective. This journey of understanding will empower you to take meaningful steps forward in both personal growth and community involvement."
                },
                "yesno":{
                    "keyword":["maybe"],
                    "detail":"maybe"
                }
            },
            "reverse": {
                "general":{
                    "keyword":["rebellion","unconventionality","non- conformity","new methods","ignorance","confusion","stifled creativity"],
                    "detail":"When you see the Hierophant in reverse, it may mean that you are feeling particularly restricted and even constrained from too many structures and rules. As a result, you have lost quite a lot of control as well as flexibility in your life. You have a particularly strong will and desire to go ahead and regain control as well as to break free from the shackles of convention. You are tempted to try unorthodox approaches or to function in a way which defies social ties and norms.\n\nThe Hierophant reversal meaning is mostly about questioning certain traditions and making sure that whatever it is that you do is the right thing for you in this certain moment."
                },
                "love":{
                    "keyword":["stale relationship","values not aligned","breaking taboo","seeking authenticity","feeling stifled"],
                    "detail":"A reversed Hierophant can indicate that your relationship may have become rather stale or boring. You may have entered the relationship since it seemed practical, but without injecting some extra excitement, it can feel dull. When it comes to shared values and creating a future together, the reversed Hierophant love meaning can indicate that your views may not align too well with your own. This doesn't have to be a dealbreaker, but may require some compromise.\n\nGenerally, this card also signals that not all the advice you may receive about your romantic relationships may be helpful for you at this time. You may be better off thinking for yourself what works, instead of relying on someone else to show you what is right for your love life."
                },
                "career":{
                    "keyword":["bureaucracy","stifling environment","confined workplace","peer pressure","lack of creativity","feeling restricted"],
                    "detail":"Your creativity, achievement or freedom at your workplace can feel stifled by bureaucracy, processes, or rules right now. You may feel restricted and confined. If you had the options, you may have been able to solve many of your organization’s problems, but they may be stubborn to keep things done “their way”. Sometimes this can mean in order to get things done, you would have to engage in chumming up to your colleagues, or even your boss. There may be a lot of pressure to follow the organization’s decisions even when you have a differing opinion. Weigh the risks of going your own way; can you stay true to your own opinions where you are currently?"
                },
                "finances":{
                    "keyword":["new financial institutions","taking risks with finances","unconventional methods","questioning traditions"],
                    "detail":"The advice of your peers when it comes to finances can feel stifling to you at the moment. You may have the itch to take risks and try new ways of earning your money, whether that means working on a side-project in your spare time, or learning about cryptocurrency. Remain responsible and realistic about what kinds of risks you’re willing to take, and what you’re willing to lose."
                },
                "feelings":{
                    "keyword":["confused feelings","questioning norms","seeking authenticity","feeling stifled","craving freedom"],
                    "detail":"When you pull the reversed Hierophant in response to how someone feels about you, it reveals a sense of confusion and rebellion within them. They may feel disconnected from traditional values or societal expectations, leading to uncertainty about their emotions toward you. This person might be questioning norms and seeking authenticity, which can create a push-pull dynamic in your relationship as they navigate their feelings.\n\nWith regard to your own emotions, the reversed Hierophant suggests that you are feeling restless and perhaps even stifled by conventional beliefs or routines. You crave freedom and self-discovery, prompting you to explore new perspectives on love and connection. Embrace this desire for growth; it’s an invitation to break free from limitations and seek deeper understanding within yourself."
                },
                "actions":{
                    "keyword":["break free from convention","explore own beliefs","challenge norms","seek fresh ideas","seek new experiences"],
                    "detail":"As the Hierophant appears in reverse, it’s time to break free from conventional thinking and explore your own beliefs. This is a call to challenge established norms and seek personal truths rather than adhering to societal expectations. In practical terms, consider engaging in activities that foster independent thought, such as journaling or exploring new philosophies through books or podcasts. Attend workshops that encourage creative expression or join groups focused on alternative perspectives. Embrace experiences outside your comfort zone, allowing yourself to question traditions and discover what resonates with you personally. This journey of self-discovery will lead to greater authenticity in your life choices."
                },
                "yesno":{
                    "keyword":["maybe"],
                    "detail":"maybe"
                }
            }
        }
    },
    {
        "title": "The Lovers",
        "category": "major arcana",
        "summary":"The trust and the unity that the lovers have gives each of them confidence and strength, empowering the other.",
        "images": [
            {
                "deck": "Rider-Waite-Smith",
                "url": "https://steve-p.org/cards/pix/RWSa-T-06.png"
            }
        ],
        "meaning": {
            "upright": {
                "general":{
                    "keyword":["love","unions","partnerships","relationships","choices","romance","balance","unity"],
                    "detail":"The primary meaning within the Lovers is harmony, attractiveness, and perfection in a relationship. The trust and the unity that the lovers have gives each of them confidence and strength, empowering the other. The bond that they have created is very strong, and it can indicate that the two are joined in marriage, and other close and intimate relationships.\n\nAnother meaning behind the lovers card is the concept of choice - a choice between things that are opposing and mutually exclusive. This could be a dilemma that you need to think about carefully and make the best decision for your situation.\n\nA more personal Lovers meaning that can apply to individuals is the development of your own personal belief systems, regardless of what are the societal norms. We see this as a development from the Hierophant, who made decrees and passed on his knowledge through a standardized system. This is one of the times when you figure out what you are going to stand for, and what your philosophy in life will truly be. You must start making up your mind about what you find important and unimportant in your life. You should be as true to yourself as you can be, so you will be genuine and authentic to the people who are around you."
                },
                "love":{
                    "keyword":["love","unions","partnerships","relationships","choices","romance","balance","unity","commitment"],
                    "detail":"When it comes to love and relationships, the Lovers card can be a welcome sight to any seeker. The Lovers tarot card signals a wonderful cohesiveness and balance of forces, indicating complimentary energies. This card represents a pair that works well together. On the other hand, because this card also symbolizes choice, and the choice of commitment, it also raises questions of how committed you are to love. This doesn’t have to refer exclusively to another person, but can also indicate a choice between love or work, love or family, love or friendship, or even sometimes love and your entire lifestyle. The idea here is that there may be a sacrifice that you must make in order to have this love. In some ways, all commitment is a sacrifice, but one made for the right person can help you grow as an individual. The choices and sacrifices that need to be made can apply to both you, a potential or existing partner."
                },
                "career":{
                    "keyword":["business partnership","harmonious relationships","career choices","collaboration","decision-making"],
                    "detail":"Sometimes, the Lovers can signal a business partnership, or a relationship with a colleague that is harmonious and beneficial to both parties. The Lovers card, contrary to popular belief, can also symbolize partnerships of a platonic kind, though at times, this can also signal a romantic relationship that can blossom. If this does happen, make sure you understand the kinds of risk that you open yourself up to, and make a decision both with your head as well as your heart. The Lovers tarot card can also suggest that there are big decisions that you need to make when it comes to your future career. You may be at a crossroads, or shifting from one path to another, or you may need to make choices between your work and other aspects of your life."
                },
                "finances":{
                    "keyword":["financial decisions","mutually exclusive choices","big expenses","long-term impacts","responsible spending"],
                    "detail":"When it comes to finances, the Lovers card can suggest that big financial decisions need to be made. You may have to choose between having one big expense versus another; the important thing to remember is that it seems like you can’t have both. One path closes the door to another path, and your choices may have larger impacts in the future."
                },
                "feelings":{
                    "keyword":["love","attraction","connection","harmony","balance","appreciation","unity","commitment"],
                    "detail":"The Lovers upright reveals a profound connection and mutual attraction. This person views you as a significant partner, drawn to your essence and valuing the bond you share. Their feelings are rooted in harmony and balance, reflecting an appreciation for both your chemistry and the emotional depth that arises from shared values and experiences.\n\nYour own feelings are prompting introspection about love and relationships. You may find yourself pondering what truly matters in this connection, carefully weighing your choices. An awakening stirs within you; a desire for unity and understanding that calls for open communication. Embrace this moment; it fosters growth both individually and together."
                },
                "actions":{
                    "keyword":["nurture relationships","engage in open communication","make aligned choices","plan heartfelt conversations"],
                    "detail":"The arrival of The Lovers suggests that now is the time to embrace connection and harmony in your life. You should focus on nurturing relationships, whether romantic or platonic, by engaging in open communication and vulnerability. This card encourages you to make choices that align with your values and desires, fostering deeper bonds with those around you. Consider planning a heartfelt conversation with someone important or participating in activities that strengthen your connections, like cooking together or exploring shared interests. Embrace the idea of partnership not just as a romantic notion but as a way to enhance all aspects of your life through collaboration and mutual support."
                },
                "yesno":{
                    "keyword":["yes"],
                    "detail":"yes"
                }
            },
            "reverse": {
                "general":{
                    "keyword":["disharmony","imbalance","conflict","detachment","bad choices","indecision","coldness in relationships"],
                    "detail":"The Lovers reversed can point to both inner and outer conflicts that you are dealing with. The disharmony can make daily life difficult and could be putting pressure on your relationships. You should take time to think about what you are punishing yourself for, so you can fix them or let them go. At this time, you should also think about your personal values and belief system to make sure that they are aligned with what you want from your life.\n\nA break in communication could be another possible interpretation. The foundation for your relationships may be cut off, creating an imbalance between you and your partner or loved ones. The unity normally present within the card has become lopsided.\n\nThe Lovers reversed can also indicate that you have been avoiding responsibility for your actions. You could have made a decision that was based on your desire for immediate gratification but are now blaming others for the consequences that are catching up to you. So, you need to make amends or let go of the past and make better decisions in the future."
                },
                "love":{
                    "keyword":["disharmony","imbalance","conflict","detachment","bad choices","indecision","cold partner"],
                    "detail":"The reversed Lovers in a relationship or romance tarot reading can suggest there is a coldness within your relationship. What was in balance is no longer working. Some issue likely stands in the way of your relationship, and must be resolved to once again form a closer bond.\n\nSometimes, a fear of commitment may also be indicated. This may be a time when you have many suitors, or your dating life may be very active. While this may be fun at first, you may be feeling that there are too many choices, or too many possibilities that you have to give up in order to develop a partnership. This will likely require some introspection on your part; make sure you are honest with yourself about your fears as well as your desires."
                },
                "career":{
                    "keyword":["conflict with colleagues","lack of motivation","poor communication","bad decisions","workplace romance issues"],
                    "detail":"You may have conflicts between your colleagues, or a business partner when the Lovers card is reversed. You may need to have long discussions in order to agree to a decision that everyone can accept. Or there may be one person that is doing all the work, or has to carry their teammate who has lost all motivation. Both colleagues may be dragged down because of one person’s inability to put in their fair share of work. At times, this card does indicate a romantic relationship started at your workplace, but reversed, this can spell trouble for you. There are likely to be consequences that you did not foresee should you continue down this path."
                },
                "finances":{
                    "keyword":["impulsive financial choices","lack of responsibility","immediate gratification","poor decision-making"],
                    "detail":"Your financial choices may be rather impulsive right now, meaning your long term financial security can be threatened. Are you making responsible choices, or are you looking for immediate gratification? Make sure that you understand what you’re truly able to afford when it comes to your finances."
                },
                "feelings":{
                    "keyword":["confusion","imbalance","doubt","detachment","fear of commitment","unresolved issues","emotional turmoil"],
                    "detail":"The arrival of the reversed Lovers card suggests that this person is grappling with confusion and imbalance in their emotions. They may feel torn between attraction and doubt, struggling to commit fully due to unresolved issues or past experiences. Their feelings are clouded by uncertainty, leading them to question the connection rather than embrace it wholeheartedly.\n\nIn terms of your own feelings, the reversed Lovers indicates a sense of disconnection or misalignment within yourself. You might be feeling conflicted about what you truly want from this relationship, battling inner doubts that prevent you from experiencing genuine intimacy. This card urges you to reflect on your desires and values, encouraging clarity so that you can navigate these emotional waters with confidence and purpose."
                },
                "actions":{
                    "keyword":["self-discovery","reevaluate relationships","introspection","journaling"],
                    "detail":"The arrival of The Lovers reversed suggests that you should focus on self-discovery and reevaluate your relationships. This card indicates a need to step back from partnerships or commitments that may not serve your best interests. Consider taking time for introspection, journaling about what truly matters to you, and identifying any patterns in past relationships that have led to dissatisfaction. Engage in activities that promote personal growth, such as pursuing a new hobby or attending workshops focused on self-improvement. By prioritizing your own needs and desires, you'll gain clarity on the connections worth nurturing in your life moving forward."
                },
                "yesno":{
                    "keyword":["no"],
                    "detail":"no"
                }
            }
        }
    },
    {
        "title": "The Chariot",
        "category": "major arcana",
        "summary":"The Chariot shows that you should pursue the plan with a structured and ordered approach.",
        "images": [
            {
                "deck": "Rider-Waite-Smith",
                "url": "https://steve-p.org/cards/pix/RWSa-T-07.png"
            }
        ],
        "meaning": {
            "upright": {
                "general":{
                    "keyword":["success","ambition","determination","willpower","control","self-discipline","focus"],
                    "detail":"The Chariot tarot card is all about overcoming challenges and gaining victory through maintaining control of your surroundings. This perfect control and confidence allows the charioteer to emerge victorious in any situation. The use of strength and willpower are critical in ensuring that you overcome the obstacles that lie in your path. The Chariot's message comes to make you stronger as you strive to achieve your goals.\n\nThe key message that he brings to you is that you must maintain focus, confidence, and determination through a process that will be full of winding turns and detours. If you have a plan or a project that you seem not to be sure about, the Chariot shows that you should pursue the plan with a structured and ordered approach. Your boldness will ensure that you achieve all that you should in this goal.\n\nIn the Chariot's quest for his goal, he may display some behavior that he has never seen within himself before - competition and a desire to succeed has perhaps brought out a more aggressive part of his personality. Aggression is a natural part of human nature, and the Chariot reminds you that it can also be used to help you take charge of your situation, but also must be reined in so that it does not hinder your way forward."
                },
                "love":{
                    "keyword":["taking action on love","taking control of love life","confidence in romance","balancing desires"],
                    "detail":"Now is the time to take the wheel, and make sure you have a clear understanding of what you’re looking for in love and romance. Once you know your destination, the Chariot tarot love meaning urges you to take action. When you take control of your love life, you are very likely to see rewards. Confidence, courage and drive will lead to success.\n\nAs you move towards your goals, the Chariot tarot love meaning however can also indicate the need to balance two urges, represented by the two horses in the card. They may pull you in different directions, but steering a clear path ahead means reining each one in so that you stay on the right path. This card can sometimes bring questions of whether the choices that you have made so far are balanced; is your relationship suffering because of long hours at work? Are you so focused on your relationship that you’ve sacrificed too much of your individuality for it? The Chariot asks us to take our lives back into our own hands again, and steer with determination."
                },
                "career":{
                    "keyword":["strong ambitions","motivation","control at work","focus on goals","self-discipline","drive to succeed"],
                    "detail":"Your ambition will take you far, when you have the Chariot in a career tarot reading. With a clear understanding of what you want for your career, you know your destination, and you can be very focused on getting there. You’re likely to feel very motivated at work, giving you the discipline, drive and self-control you need to succeed. If you’re looking to change roles, or get a more senior position at your current workplace, this card signals that all you need to do is go for it. When it comes to your work environment, remain clear of distractions; this can include office politics or rivals; make sure you remain focused on what you need to do."
                },
                "finances":{
                    "keyword":["financial stability","overcoming obstacles","desire to save","desire to invest","self-discipline in spending"],
                    "detail":"If there have been any financial obstacles that have stood in the way of your material stability, now can be the time to deal with them. The Chariot gives you motivation, focus and determination to conquer those challenges. With enough self-discipline, you’ll be able to feel comfortable with your financial situation."
                },
                "feelings":{
                    "keyword":["ambition","determination","confidence","control","commitment","motivation","deep-rooted feelings"],
                    "detail":"The Chariot reveals a powerful drive and ambition in how someone feels about you. They are fueled by their emotions and possess the determination to overcome any obstacles. This person recognizes the potential in your connection and is ready to take charge, confidently navigating challenges that may arise. Their feelings are deep-rooted; they are committed to moving forward with purpose.\n\nThe arrival of The Chariot signals a surge of confidence and motivation within you. You feel empowered to chase your desires, embracing the journey ahead with enthusiasm. An inner strength guides you as you navigate your emotions, urging you to harness this momentum for personal growth and fulfillment."
                },
                "actions":{
                    "keyword":["take decisive action","embrace challenges","create plans","maintain focus","build confidence","be disciplined"],
                    "detail":"As The Chariot reveals itself, now is the time for you to take decisive action and harness your willpower. Embrace challenges as opportunities for growth, focusing on your goals with determination. This card encourages you to adopt a new perspective: see obstacles not as barriers but as stepping stones toward success. In practical terms, create a clear plan outlining your objectives and break them into manageable tasks. Engage in activities that build confidence, such as public speaking or physical training. Stay disciplined and maintain focus; channel any distractions into motivation, propelling yourself forward on your journey to victory."
                },
                "yesno":{
                    "keyword":["yes"],
                    "detail":"yes"
                }
            },
            "reverse": {
                "general":{
                    "keyword":["forceful","no direction","lack of control","powerless","aggression","obstacles","confusion"],
                    "detail":"The reversed Chariot's appearance in a reading can help you become aware of both your aggression, and your lack of willpower. It may either be saying that you are lacking in focus, motivation or direction, or that you are being warped by your obsession with your goals. In the former case, let the Chariot be a reminder that you can emerge victorious as long as you can gather the courage to do so. In the latter, your impulses may be another factor that you must rein in. To see the Chariot in reverse may suggest that you need to come to terms with the fact that you cannot always be in control.\n\nThe Chariot reversal meaning can also be an indication of lack of control and direction over your life. You are at the mercy of the opposing forces and the obstacles, and cannot seem to muster the strength to take over. You are taking everything lying down, and life is dragging in any direction that it pleases. It should serve as a wakeup call and reminder that you will need to tighten some loose ends and take charge of your destiny."
                },
                "love":{
                    "keyword":["obsession with finding love","forcefulness in love","lack of balance in relationships","emotional confusion"],
                    "detail":"When reversed, the Chariot tarot love meaning can signal an overwhelming drive to find love, so much so that other goals and aspirations may have been forgotten. Sometimes, one has to remember that in life, we cannot control everything around us, and no matter what we do, we can’t make the perfect person appear to us. Showing up everyday with hope and enthusiasm is important, but so is patience. Let love find you.\n\nA reversed Chariot in love can also signal that things may be out of balance, and you may need to work to correct them again. Make sure that your work, love, family and friendships are not suffering because you are overextending in one or another. This may be at the root of disagreements with your partner."
                },
                "career":{
                    "keyword":["lack of ambition","no direction","feeling powerless","aggressive behavior","obstacles in career"],
                    "detail":"Reversed, the Chariot can signal either a lack of ambition, focus or drive, or alternatively, too much of it. Ultimately, this card brings up questions about how forceful or aggressive you are when pursuing your goals. Are you someone that waits around passively for things you want to happen, hoping that they’ll fall in your lap? Or are you so forceful, that you are inconsiderate of others in your pursuit of success? Both approaches can bring you trouble. Being aggressive to the point of hostility can backfire on you, while being so passive can never bring you the kind of happiness you desire. Are you okay with either of these options? What does a healthy middle ground look like?"
                },
                "finances":{
                    "keyword":["rushing into purchases","hesitant about financial decisions","lack of control over finances","indecision"],
                    "detail":"Be wary of rushing into purchases without thinking them through. You may not have everything you need to know to make an educated decision. Alternatively, if this doesn’t describe you, you may be too hesitant when it comes to your money. You may be in a position to invest your money into something, but have been wavering taking any action."
                },
                "feelings":{
                    "keyword":["confused about feelings","overwhelmed by emotions","lack of direction","self- doubt","frustration with commitment"],
                    "detail":"The appearance of the reversed Chariot points to a sense of confusion and lack of direction in how this person feels about you. They may be struggling with their emotions, feeling overwhelmed or uncertain about where they stand. This indecision can lead to frustration as they grapple with conflicting feelings, making it hard for them to commit or express themselves clearly.\n\nWith regard to your own feelings, the reversed Chariot suggests that you might also feel a loss of control or purpose in this situation. You could be experiencing self-doubt and questioning your path forward. It’s essential to take a step back and reassess what truly drives you; finding clarity within yourself will help navigate these turbulent emotions more effectively."
                },
                "actions":{
                    "keyword":["pause and reassess goals","seek inner peace","collaborate with others","embrace stillness","clarify thoughts"],
                    "detail":"In the presence of the reversed Chariot, you may be feeling a lack of direction or control in your life. Now is the time to pause and reassess your goals and motivations. Instead of pushing forward aggressively, focus on understanding what truly drives you. Take a step back from any competitive pursuits and consider collaborating with others instead of going it alone. Engage in activities that promote inner peace, such as meditation or journaling, to clarify your thoughts. This period calls for patience; embrace stillness and allow yourself to realign with your true desires before charging ahead again."
                },
                "yesno":{
                    "keyword":["no"],
                    "detail":"no"
                }
            }
        }
    },
    {
        "title": "Strength",
        "category": "major arcana",
        "summary": "Your resilience will greatly aid you, and your fearlessness means that you should have no issues speaking your mind.",
        "images": [
            {
                "deck": "Rider-Waite-Smith",
                "url": "https://steve-p.org/cards/pix/RWSa-T-08.png"
            }
        ],
        "meaning": {
            "upright": {
                "general":{
                    "keyword":["courage","bravery","confidence","compassion","self-confidence","inner power","resilience","fearlessness"],
                    "detail":"When you get the Strength card in an upright manner during your tarot reading, then it shows that you have inner strength and fortitude during moments of danger and distress. It shows that you have the ability to remain calm and strong even when your life is going through immense struggle. It also shows that you are a compassionate person and you always have time for other people even if it's at your own expense.\n\nGetting the strength card means that you are a very patient individual who is likely to accomplish anything that they put their mind to. Your resilience will greatly aid you, and your fearlessness means that you should have no issues speaking your mind. This card also indicates this kind of compassion will always be rewarded with having a lot of stability in your life either presently on in the near future."
                },
                "love":{
                    "keyword":["passionate romance","strong relationship","compassion","empathy","emotional stability","inner strength"],
                    "detail":"You may find yourself in a passionate and fiery romance when you draw the Strength card in a love tarot reading. The intense feelings suggested by this card can indicate both a strong relationship, and also one that can be prone to anger, jealousy or other emotional explosions. There are both pros and cons with this kind of relationship. Alternatively, Strength’s tarot love meaning is one of compassion, empathy and inner strength; you may find that these qualities are bound to attract the partners that you need, or bring you and your existing partner closer together than ever. Empathy may give you greater insight to both yours and your partner’s needs and insecurities. Should you find yourself in an argument or in heated moments, it may be better for you to treat each other with patience and gentleness, rather than allowing your anger to take control."
                },
                "career":{
                    "keyword":["self mastery at work","bold career moves","taking big steps","harnessing instincts","courage to advance"],
                    "detail":"If you could harness your animalistic instincts; your anger, your drive and passion, you can take big steps in your career. This doesn’t mean to let these instincts take over, but rather work in harmony with them, or channel them into productive use. Here is where you’ll be able to find your power; this card signals that you likely already have the talent and the skill, you only need to muster your courage to make big moves. If you’re looking for a promotion, do something to get noticed. If you’re looking to change your entire career, take the plunge and do it. If you’re dreaming about starting your own business, push yourself to take those next steps and just start."
                },
                "finances":{
                    "keyword":["controlled spending","financial stability","bold purchases","comfortable position","managing finances"],
                    "detail":"If you’ve been working well on controlling impulsive spending, it’s likely that you’ll find yourself in a comfortable position now. So long as you continue to exercise control, you should be fine. You may also be ready to make bold moves in terms of your purchases; perhaps putting your finances to work on something you’ve always been dreaming of."
                },
                "feelings":{
                    "keyword":["admiration","respect","trust","compassion","emotional stability","courage","resilience","connection"],
                    "detail":"When the upright Strength card appears in a reading about how someone feels about you, it reveals their deep admiration and respect for your resilience. They see you as a beacon of courage and compassion, drawing them closer to you. Their feelings are anchored in trust; they value your ability to face challenges with grace, which makes them feel secure in their connection with you.\n\nOn your end, Strength indicates that you're experiencing a surge of self-confidence and emotional stability. You’re embracing vulnerability while understanding the importance of setting healthy boundaries. This balance empowers you to navigate your emotions effectively, fostering personal growth and deeper connections with those around you."
                },
                "actions":{
                    "keyword":["challenges with grace","nurture relationships","offer support","engage in yoga or meditation","volunteer"],
                    "detail":"When you draw the Strength card upright, it’s a powerful reminder to tap into your inner resilience and courage. Now is the time to confront challenges with grace and confidence, recognizing that true strength lies in compassion and patience. You should focus on nurturing relationships, offering support to those around you while also standing firm in your beliefs. Engage in activities that build both physical and emotional endurance, such as yoga or meditation, which can help center your energy. Additionally, consider volunteering or mentoring someone who could benefit from your guidance; this will not only strengthen bonds but also reinforce your sense of purpose."
                },
                "yesno":{
                    "keyword":["yes"],
                    "detail":"yes"
                }
            },
            "reverse": {
                "general":{
                    "keyword":["self-doubt","weakness","low confidence","inadequacy","cowardice","forcefulness","fear of failure"],
                    "detail":"An upside down Strength card can mean that you are (or about to) experience an intense anger or fear in your life. You seem to be lacking the inner strength that this card normally represents, meaning you might be experiencing fear, and a lack of conviction and confidence in your own abilities. This can mean that you have forgotten all about your passions and the kind of joy, happiness, and fulfillment that came with doing what you love.\n\nA reversed strength card in a reading might also mean that one is experiencing depression because of a number of reasons and because of that, it is draining all of the happiness from their lives.\n\nOne might end up being withdrawn from society because of the unhappiness or depression since they may feel people are the reason why they are so sad. It can also be a sign of jealousy, especially when everyone seems to be happy or excelling in every aspect of life while you are stagnating. This card indicates that you must learn to gain confidence in order to re-harness your inner strength."
                },
                "love":{
                    "keyword":["self-esteem issues","insecurity","codependency","negativity about love","lack of trust","domineering behavior"],
                    "detail":"In a love tarot reading, when Strength is reversed, the card can signal a bit of codependency in your relationship. This may stem from some forms of insecurity that make it difficult for you and your partner to be more independent and pursue your own interests. Being full individuals with your own lives brings more to your partnership; it doesn’t detract from it. Make sure that there is a strong sense of trust in your partnership. A reversed Strength tarot love meaning can also indicate that force and power are becoming more apparent themes in your relationship. One partner may be becoming more and more domineering, instead of empathic and understanding. You may have to make sure that one partner’s needs aren’t being trampled over in favor of another’s."
                },
                "career":{
                    "keyword":["self-doubt","weakness","impostor syndrome","fear of making big moves","anxiety about career choices"],
                    "detail":"Have your fears been standing in the way of your career aspirations? The reversed Strength card suggests that you may have everything you need in order to find success, except perhaps a healthy dose of confidence and belief in yourself. You may constantly second-guess yourself, letting your anxiety and self-doubt take control and prevent you from making the choices that can propel your career forward. If you actually took a closer look at yourself, you would find that you are more capable than you actually believe. Trust in your own abilities, and others will trust you as well."
                },
                "finances":{
                    "keyword":["compulsive spending","financial insecurity","hesitancy about spending","lack of confidence in finances"],
                    "detail":"Avoid compulsive spending now, as it can do more damage to your financial situation than usual. Alternatively this card can also suggest hesitancy about spending your money on things that can be helpful to you now, even if you may have an abundance of funds. There can be a feeling of financial insecurity, regardless of what your actual situation is."
                },
                "feelings":{
                    "keyword":["overwhelmed","insecure","self-doubt","vulnerability","fear of connection","emotional struggle","lack of confidence"],
                    "detail":"The appearance of the reversed Strength card points to someone who may be grappling with their emotions and lacks confidence in expressing them. They might feel overwhelmed or insecure, leading to a sense of vulnerability that makes it difficult for them to connect deeply. Their feelings could be clouded by self-doubt, causing them to hold back rather than fully embrace what they feel for you.\n\nWith regard to your own feelings, the reversed Strength indicates an internal battle where you might be feeling weak or unsure of yourself. You could be grappling with insecurities that prevent you from asserting your needs or desires clearly. This card encourages you to confront these feelings head-on and find ways to reclaim your inner strength, allowing yourself the grace to heal and grow amidst uncertainty."
                },
                "actions":{
                    "keyword":["acknowledge fears","embrace vulnerability","nurture self-compassion","seek support","engage in meditation"],
                    "detail":"When you draw the Strength card reversed, it signals that you may be feeling overwhelmed or lacking confidence in your current situation. It’s time to embrace vulnerability and acknowledge your fears instead of suppressing them. Focus on nurturing self-compassion and understanding that true strength lies in being honest with yourself. In practical terms, consider journaling about your feelings or seeking support from a trusted friend or mentor who can help you gain perspective. Engage in activities that build your inner resilience, such as meditation or gentle exercise, allowing you to reconnect with your core self and regain balance before moving forward confidently."
                },
                "yesno":{
                    "keyword":["no"],
                    "detail":"no"
                }
            }
        }
    },    
    {
        "title": "The Hermit",
        "category": "major arcana",
        "summary": "He walks through the dark night of his unconscious, guided only by the low light of the northern star, with his destination being his home, his self.",
        "images": [
            {
                "deck": "Rider-Waite-Smith",
                "url": "https://steve-p.org/cards/pix/RWSa-T-09.png"
            }
        ],
        "meaning": {
            "upright": {
                "general":{
                    "keyword":["self-reflection","introspection","contemplation","solitude","search for self","inner voice","personal growth"],
                    "detail":"The Hermit is a seeker for the knowledge that comes from within. A lonely wanderer in the path of the night, he searches for that which can only be gained with long periods of solitude - the inner voice. To hear it, he must disconnect from the crowds whose voices and desires threaten to overcome his own. He walks through the dark night of his unconscious, guided only by the low light of the northern star, with his destination being his home, his self.\n\nYou are currently contemplating that you need to be alone. Never be afraid to take this chance to reflect, as it could help you clear your mind of all the clutter that comes with everyday life. The Hermit may also refer to your effort in taking action that is authentic and aligned with your true self. You are perhaps searching your inner soul for guidance on what is right, and where your next steps are to be.\n\nThe hermit's appearance in a reading can also denote the appearance of someone who will come to your life that will be your mentor."
                },
                "love":{
                    "keyword":["self-reflection","introspection","solitude","self-understanding in love","personal growth","emotional clarity"],
                    "detail":"Love, being one of life’s greatest mysteries, can be a great teacher. It requires all of us to truly know ourselves, our needs, our fears and our insecurities. The Hermit tarot love meaning can signal that we may need some time alone in order to develop some insight about our selves before forming a strong romantic relationship with another person. This period may feel a bit lonely, but it will place you on the right path to finding a love that you are meant to have. If you’re already in a relationship, this soul-searching is something that the two of you may want to do together. Both of you may want to think about what you expect out of a relationship, and what may make you happier. The initial talks may be uncomfortable, but will prepare a strong foundation for tackling the future ahead."
                },
                "career":{
                    "keyword":["contemplating next steps","searching for purpose","seeking fulfillment","reassessing career goals"],
                    "detail":"You may be spending some much needed time thinking about what you want out of your career right now. You may feel as though the path you are treading at the moment is not really working for you, and there can be the sense of not being fulfilled. Right now, you are trying to understand what kind of work would give you joy on all levels. If you’ve been pursuing a career purely for money, or financial stability, these qualifications are no longer enough for you. You may be looking for a purpose, or at least something that gets you closer to who you want to be."
                },
                "finances":{
                    "keyword":["contemplating role of finances in happiness","less focus on material things","seeking fulfillment"],
                    "detail":"You may be coming to the realization that money doesn’t bring you happiness right now. This may be a time with less focus on material things, and more focus on trying to understand where you can truly find fulfillment."
                },
                "feelings":{
                    "keyword":["thoughtful","introspective","seeking clarity","drawn to solitude","profound feelings","wrestling with uncertainties"],
                    "detail":"The Hermit signals a deep dive into someone’s feelings about you. This person is taking time to reflect on their emotions and the bond between you. They feel drawn to solitude, seeking clarity in their thoughts, indicating that their feelings are thoughtful and profound, not rushed. While they appreciate your presence, they may be wrestling with uncertainties or personal issues that require them to step back for now.\n\nYour own feelings call for introspection as The Hermit encourages self-discovery. You might find yourself searching within for answers, contemplating what truly matters in this relationship. There’s a desire for deeper understanding of your emotional landscape, prompting you to explore what fulfillment means at this moment. Embrace this period of reflection; it can lead to greater insight into both yourself and the dynamics at play with this person."
                },
                "actions":{
                    "keyword":["self-reflection","introspection","seek solitude","journal insights","meditate daily","disconnect from distractions"],
                    "detail":"When you draw The Hermit, it’s a powerful reminder to embrace solitude and reflection. You should seek a quiet space to reflect on your inner thoughts and feelings, allowing yourself to disconnect from external distractions. This could mean taking a day off from social media or spending time in nature, where you can contemplate your life’s direction. Embrace this period of self-discovery by journaling your insights or meditating daily. By turning inward, you will gain clarity about what truly matters to you, helping illuminate the path forward with renewed purpose and understanding. Trust that this journey within will guide your next steps wisely."
                },
                "yesno":{
                    "keyword":["maybe"],
                    "detail":"maybe"
                }
            },
            "reverse": {
                "general":{
                    "keyword":["loneliness","isolation","disconnection","rejection","feeling lost","social withdrawal","emotional confusion"],
                    "detail":"When reversed, you are perhaps in a situation where you'd like to be alone; there is nothing wrong about that. However, there is a possibility that your seclusion may become harmful to both yourself and others. Though the Hermit sets forwards with noble intentions to search for his inner truth, his path inward may also be filled with great danger. Going inward may lead to madness and the abyss, for the unconscious is filled with images that he may not yet understand, lurking and waiting to lure you ever inside. Like a man that gets lost in his own dreams, the hermit may find himself stuck in a world of his own, alone, trapped, unreal. You must learn to balance your need for truth with connection to your fellow human.\n\nWhen it comes to work, the hermit reversal meaning refers to your preparedness to get to the bottom of something that has been troubling you for quite some time now. There is searching to be done, and it will be your responsibility to ask the question that will allow the other people to understand the circumstances."
                },
                "love":{
                    "keyword":["romantic rejection","loneliness","feeling distant from partner","forced isolation","drifting apart"],
                    "detail":"The reversed Hermit tarot love meaning can indicate a period of loneliness, one that is being forced on you instead of one that you are initiating yourself. While this time may be trying, making the most of it can help you concentrate on your own goals, and clarify what it is you want from a partner and from life. These will be the building blocks for creating a strong future relationship. Should you already be in a relationship, you may find that one of you feels distant and is drifting away. Someone may feel alone in the partnership, despite each person’s efforts. Now is the time to examine these dynamics and see whether you can extend a hand. Attention, care and a strong dose of self-awareness may be needed in order to feel connected again."
                },
                "career":{
                    "keyword":["realigning career goals","feeling like an outcast at work","avoiding teamwork","working alone","seeking social support"],
                    "detail":"At times, the reversed Hermit can signal coming out of a period of contemplation. You may be ready to rejoin society, this time with a clearer understanding of what it is you want in terms of your career. You may now need to do a bit of realignment, whether it’s looking for a new job, networking to find mentors and teammates, or other more socially related aspects of developing your career. On the other hand, it can also be that your period of solitude can be extending further; you may choose to avoid working with others altogether. Being on your own may feel much less limiting at first; but make sure you continue to receive social support. At times, this card can also indicate being forced to work alone, leading to feelings of loneliness, or being an outcast amongst your coworkers."
                },
                "finances":{
                    "keyword":["loneliness","isolation","seeking advice","better understanding of material situation","confusion about finances"],
                    "detail":"When it comes to financial decisions, you may be ready to look for advice from outside sources. Ideally you have come out of a period of contemplation on what material security and money means to you, and you may be putting those insights to use. Hopefully, this can lead to a better relationship with your material situation."
                },
                "feelings":{
                    "keyword":["confused feelings","emotional distance","loneliness","uncertainty about relationship","feeling disconnected"],
                    "detail":"When you draw the reversed Hermit, it signals a deep sense of confusion and isolation in how this person feels about you. They may be struggling with their emotions, feeling disconnected or unsure about what they truly want. This uncertainty can lead to feelings of loneliness or even withdrawal from the relationship, as they grapple with their inner thoughts rather than openly expressing them.\n\nYou might feel a call to reflect on these dynamics and experience a mix of frustration and concern. The reversed Hermit prompts you to examine whether you're seeking clarity within yourself while also yearning for deeper connection. It encourages you to confront any fears of vulnerability that may be holding both of you back from genuine intimacy and understanding."
                },
                "actions":{
                    "keyword":["step out of isolation","engage in conversations","join local groups","share thoughts with friends"],
                    "detail":"When you draw the reversed Hermit, it’s a clear signal that stepping out of isolation is essential. Instead of retreating into solitude, seek new perspectives by engaging in conversations or activities that challenge your current beliefs. Consider joining a local group or class where you can share ideas and learn from others. This action will not only broaden your horizons but also help you find clarity on personal issues you've been contemplating alone. Embrace vulnerability by sharing your thoughts with trusted friends; their insights may illuminate paths you hadn’t considered before."
                },
                "yesno":{
                    "keyword":["maybe"],
                    "detail":"maybe"
                }
            }
        }
    },
    {
        "title": "The Wheel of Fortune",
        "category": "major arcana",
        "summary": "The same forces that govern the changing of the seasons, or the rising and setting of the sun is also the master of luck and the fate of individuals.",
        "images": [
            {
                "deck": "Rider-Waite-Smith",
                "url": "https://steve-p.org/cards/pix/RWSa-T-10.png"
            }
        ],
        "meaning": {
            "upright": {
                "general":{
                    "keyword":["change","cycles","fate","luck","fortune","unexpected events","decisive moments"],
                    "detail":"The Wheel of Fortune turns evermore, seemingly to communicate that life is made up of both good and bad times, and that the cycle is one that we cannot control. It is something that is subjected to both kings and workers, and that nobody on earth can avoid what is fated. When you have good moments in your life, make sure that you enjoy to the fullest, for what comes up must always go down. The same is true in reverse - when you are in a bad situation, things will eventually become better again.\n\nGreater forces that are outside of human control are at work here. The same forces that govern the changing of the seasons, or the rising and setting of the sun is also the master of luck and the fate of individuals. Where it lands is as random as chance - you may find yourself at either the top or bottom, but remember that no matter what the outcome it may not last for very long, for the wheel always turns."
                },
                "love":{
                    "keyword":["relationship changes","navigating change with partner","making adjustments","unexpected shifts in love"],
                    "detail":"Life is full of unexpected changes, and love is no different. The Wheel of Fortune tarot love meaning can signal great changes in your relationship, perhaps one that you didn’t see coming. These aren’t necessarily bad things, but adjustments may have to be made. The commitment you have with your partner may be tested now, and both of you may have to put in some effort or sacrifice in order to remain together. Should you choose to make the choice, your partnership may become closer than ever as the two of you learn to navigate the ups and downs of life together as a team. It is important to understand that whether the changes are positive or negative, they are not forever, for the wheel is always turning."
                },
                "career":{
                    "keyword":["luck in career","opportunities present","adapting to changes at work","embracing new challenges"],
                    "detail":"Big changes may be coming when it comes to your career. Should you be considering making a switch in your career path or your position, now may be a good time to make those moves. Try and be more aware of the opportunities that are in your environment for you now, and say yes when they arise. Sometimes, the changes that are coming your way may be difficult and challenging, but these can actually be blessings for you to develop your skills and get you ready for future growth. Embrace these changes, and make yourself adaptable. Going alongside the flow of these changes is likely to bring you success."
                },
                "finances":{
                    "keyword":["changes in material situation","being flexible with finances","adapting to financial opportunities"],
                    "detail":"When it comes to your finances, the Wheel of Fortune also suggests change, so be ready to adapt to whatever comes your way. If you’ve been financially comfortable, make sure you keep putting a certain amount away to get you through hard times. Should you be dealing with material hardship, be assured that this not meant to last forever. Keep your eyes open to any opportunities that open up to you."
                },
                "feelings":{
                    "keyword":["excited about connection","feeling hopeful","experiencing change","sense of possibility","navigating uncertainty"],
                    "detail":"When the Wheel of Fortune appears upright in a reading about how someone feels about you, it reveals their emotions are shifting and evolving. They experience an exhilarating sense of possibility, as if fate has intertwined your paths for a purpose. This person recognizes that your connection is part of a larger cycle, filled with highs and lows, that ultimately fosters growth and transformation. Their feelings dance between excitement and uncertainty, influenced by life's unpredictability.\n\nThis card also prompts you to examine your own emotions. You might feel hopeful and ready for new experiences or anxious about the changes on the horizon. Embrace this vibrant energy; it invites you to trust the journey ahead, understanding that each twist offers valuable lessons. Your feelings reflect an awareness of life’s constant evolution, encouraging you to adapt while staying optimistic about what lies ahead in your shared journey."
                },
                "actions":{
                    "keyword":["embrace change","seek new opportunities","adapt perspective","take calculated risk","reflect on past"],
                    "detail":"When you draw the upright Wheel of Fortune, it’s a powerful reminder to embrace change and recognize the cycles of life. You should be open to new opportunities and willing to adapt your perspective. This may involve taking calculated risks, such as pursuing a new job or starting a creative project that excites you. Reflect on past experiences to identify patterns in your life; this awareness can guide your next steps. Engage with others who inspire you, as their energy can propel you forward. Trust in the natural flow of events and take action by seizing chances when they arise, knowing that fortune favors the bold."
                },
                "yesno":{
                    "keyword":["Yes"],
                    "detail":"Yes"
                }
            },
            "reverse": {
                "general":{
                    "keyword":["bad luck","lack of control","clinging to control","unwelcome changes","delays","frustration","instability"],
                    "detail":"When the wheel is reversed, it means that luck has not been on your side and misfortunes have been following you. When it's associated with this card, you must understand that these are due to external influences that you cannot control. Like the wheel, our luck and our fate is always in motion, and sometimes we are on the bottom. Be assured that the wheel will turn again, and you will be okay again soon.\n\nWhat you shouldn't do however, is cling to the illusion of control. Perhaps in this turn of the wheel, the lesson is to learn to let go and release. There are things that cannot be moved by human will and action alone. When we do not let go, it can bring only more suffering, for you may blame yourself for actions that could not have altered the situation. When we learn to accept, we also learn to forgive ourselves. We learn to move on, and move forward - and eventually, we learn that this feeling of acceptance can push the wheel again forward, and move it towards a new cycle."
                },
                "love":{
                    "keyword":["external events affecting relationship","love life out of control","feeling stuck in cycle","uncertainty"],
                    "detail":"There are times, that no matter how much we try, the world will not bend to one’s will. Life may have thrown an unexpected wrench into your plans, and there is not much that you can do other than remember that this too will pass. It is likely that some external factor may be affecting your relationships right now, and you may have to adapt to it, and accept it with patience rather than attempting to control this situation. Other aspects of your life may be demanding right now, as your romantic life may have to take a pause. If you are in a partnership, try and tackle these problems as a team and communicate openly."
                },
                "career":{
                    "keyword":["bad luck","lack of control","clinging to control","unwelcome changes","delays","failure to adapt"],
                    "detail":"Are things in your work life changing quickly? You may find it difficult to keep up at the moment. All these surprises are things that may feel disruptive to your plans. You may keep trying to make a past solution work, instead of flowing alongside the events that are unfolding right now. It is important to not cling to the past or your expectations, but instead remain flexible and ready to change your plans. Are your responsibilities changing at work? Does your project’s requirements keep updating? This can be very frustrating, but instead of fighting it, try and figure out your own process to deal with it. It’s important to make sure you find your center."
                },
                "finances":{
                    "keyword":["bad luck","lack of control","unwelcome changes","unexpected financial changes","preparation"],
                    "detail":"Be wary of taking risks when it comes to your finances, as this card can suggest unexpected and unwelcome events. It may be wise right now to build a small emergency fund; even if nothing does happen, having something stowed away can help relieve anxiety about what comes next. The world is constantly changing, make sure you’re ready for it."
                },
                "feelings":{
                    "keyword":["uncertainty","frustration","feeling stuck","mixed signals","lack of control","anxiety about future"],
                    "detail":"The appearance of the reversed Wheel of Fortune points to a sense of unpredictability and instability in how this person feels about you. They may feel uncertain or even frustrated, as if circumstances beyond their control are influencing their feelings toward you. This card indicates they might be struggling with change and are unsure how to navigate their connection with you, leading to mixed signals or hesitance.\n\nWith regard to your own feelings, the reversed Wheel of Fortune reflects a similar turmoil within yourself. You could be grappling with anxiety about the future or feeling stuck in a cycle that seems unending. There may be moments when you question your choices and wonder if you're on the right path. It’s essential to recognize these feelings as part of life's ebb and flow; embracing uncertainty can lead to growth and new opportunities ahead."
                },
                "actions":{
                    "keyword":["introspection","reevaluation","identify patterns","set specific goals","seek guidance","journal thoughts"],
                    "detail":"The arrival of the reversed Wheel of Fortune suggests that you should embrace a period of introspection and reevaluation. This is your cue to take control of your circumstances rather than leaving things to chance. Focus on identifying patterns in your life that may be holding you back, such as negative habits or unproductive relationships. Take actionable steps like journaling to clarify your thoughts, setting specific goals for personal growth, or seeking guidance from mentors who can offer fresh perspectives. By actively engaging with these changes, you will create opportunities for positive transformation and regain a sense of direction in your life."
                },
                "yesno":{
                    "keyword":["no"],
                    "detail":"no"
                }
            }
        }
    },
    {
        "title": "Justice",
        "category": "major arcana",
        "summary": "If you have been wronged, this card's appearance may bring you relief. On the other hand, if your actions caused pain to others, this card serves as a warning.",
        "images": [
            {
                "deck": "Rider-Waite-Smith",
                "url": "https://steve-p.org/cards/pix/RWSa-T-11.png"
            }
        ],
        "meaning": {
            "upright": {
                "general":{
                    "keyword":["justice","karma","accountability","truth","honesty","integrity","fairness","cause and effect"],
                    "detail":"The decisions that you make now have long-term effects in all things, both for yourself and others. There will always come a time where you will be judged. The Justice tarot card appearing in a reading signals that a judgment will be made fairly and accordingly. The decisions that you have made in the past will be carefully weighed with fairness. Your feelings around this card may differ depending on your situation.\n\nIf you have been wronged, this card's appearance may bring you relief. On the other hand, if your actions caused pain to others, this card serves as a warning. Her appearance represents a chance for you to change your actions now for a better future. When a tarot card reading shows the figure of justice, it is time to account for your actions.\n\nAnother meaning of the Justice card is truth. Truth must come to pass, and this cannot be found from the mouths and gossip of others. Instead, it's based on facts. Learn the truth about others and yourself, speak and know the truth before passing a judgment. During a reading, when you see the Justice Tarot card, you need to be fair in all your deeds. By following the right procedure to learn the truth, you will understand what your tasks are.\n\nAnother meaning of Justice Tarot card during a reading is to symbolize that attention is needed. It could be about your life, career or just an important decision that you need to make. If you have been unsure about something, it is time to get a solution once and for all."
                },
                "love":{
                    "keyword":["romantic efforts rewarded","compromise","treating partner fairly","kindness in love","positive disposition"],
                    "detail":"Justice is about karma, and if you’ve been putting forth the effort, love and romance will be coming your way. If you’ve been kind, loving and supportive, your relationships will be a mirror of what you’ve been giving to others. If you’ve been single, your loving and positive disposition will make you especially attractive to new potential romances.\n\nBecause this card is all about the law of cause and effect, make sure you have been treating your partner fairly. Watch out for resentment and defensiveness, and ensure that conflicts in your relationships are handled with respect and trust in your other half. Compromise and understanding is needed now. Sometimes this card is also about being tactful, and expressing your frustrations in a way that are mindful of your partner’s feelings. As long as issues hare handled with honesty and good faith, your relationship will thrive."
                },
                "career":{
                    "keyword":["integrity at work","accountability","fairness","truthfulness","responsibility","workplace disputes resolved"],
                    "detail":"If you’ve been involved in any workplace disputes, the Justice card can signal that everything should work out in your favor as long as you’ve been truthful, honest and fair with your dealings. If this doesn’t apply to you, this card can simply be a reminder to always act with integrity, and ensure that you take responsibility for your actions, even when you make a mistake. As scary as this can be sometimes, others will trust and respect you for your honesty and commitment to truth. With fair and balanced dealings, your career can flourish."
                },
                "finances":{
                    "keyword":["balancing finances","fair financial dealings","accountability in money matters","honest transactions"],
                    "detail":"This card is a reminder to keep things honest, just and fair when it comes to your financial dealings. Ensure that you balance your needs with others, and that what you take is balanced with what you give. Continue to keep things balanced, and your finances should be just fine."
                },
                "feelings":{
                    "keyword":["fairness","accountability","respect","truthfulness","introspection","kindness","balance","reflection"],
                    "detail":"The upright Justice card reveals how someone feels about you, showing that they approach their emotions with a level-headed and analytical mindset. Their feelings aren’t just driven by chemistry; they reflect on how you've treated them in the past. If your interactions have been filled with kindness and respect, expect those positive vibes to return tenfold. On the other hand, if negativity or hurt has marked your relationship, they're acutely aware of it and feel accordingly.\n\nThis card serves as a mirror for your own feelings, prompting introspection about fairness and balance within yourself. You might be wrestling with questions of integrity or seeking clarity in your emotional landscape. Justice urges you to evaluate whether you're being true to yourself while also considering how your actions align with what you desire from others."
                },
                "actions":{
                    "keyword":["seek balance","act with integrity","evaluate decisions","address conflicts","speak truthfully","listen actively"],
                    "detail":"Guided by the Justice card, now is the time for you to seek balance and fairness in your actions. This means evaluating situations with a clear mind and making decisions based on truth rather than emotion. You should focus on being honest with yourself and others, ensuring that your choices reflect integrity. Consider addressing any unresolved conflicts by having open conversations where you express your feelings while also listening to others' perspectives. Additionally, take steps to align your daily actions with your values; this could involve volunteering or advocating for causes that resonate with you, reinforcing a sense of justice in both personal and community matters."
                },
                "yesno":{
                    "keyword":["maybe"],
                    "detail":"maybe"
                }
            },
            "reverse": {
                "general":{
                    "keyword":["injustice","retribution","dishonesty","corruption","unfairness","avoiding accountability","denial"],
                    "detail":"A reversed Justice tarot card could indicate various things. One Justice reversal meaning is to show you are living in denial. You are not willing to accept the consequences of your actions or others. You are running from your guilt. You must however, be aware that these are actions that are in the past. Your future depends on your actions today - and what you will do to tip the scales in balance again. How can you make up for your wrongs? Taking action gives you a chance to change and stop judging yourself. In legal matters, this could represent an unfair outcome of a case that you will not accept."
                },
                "love":{
                    "keyword":["unfair romantic expectations","blaming partner unfairly","lack of compromise","unrealistic standards"],
                    "detail":"Sometimes, love and romance can be unfair. You may be doing your part in putting yourself out in the world, but luck is still not on your side. Whatever the case may be, sometimes one must grit their teeth and carry on. Now may also be a good time to check whether your are being fair with your expectations about love. Are you looking for someone absolutely perfect, but are unable or unwilling to work on your own flaws? Be honest with your requirements, as well as your own baggage. If you’re in a relationship, this may be a difficult time, and fairness and compromise are needed more than ever. Don’t blame others, or your partner for things that are your responsibility."
                },
                "career":{
                    "keyword":["unfair work environment","dishonesty in career","not being accountable","avoiding responsibility"],
                    "detail":"You may be dealing with some unfair situations at work right now. This can mean taking the blame for someone else, or others attempting to undermine the quality of your work. While it may be tempting to fight fire with fire, this can only worsen the issue. Remain reasonable, logical and forthright with how you handle this situation. With reversed Justice, you may find that heated confrontations can mean the blame will rest on you. Sometimes, this card can also signal that you haven’t quite been honest when it comes to your career. This can lead to trouble for you in the future; or even if it doesn’t, can lead to continued anxiety as you wonder when the other shoe will drop. If you still have time, make amends and change your habits now. If you have been avoiding accountability for a mistake and hoping that the blame may fall on others, not only are you eroding trust between you and your colleagues, but you are also throwing away a chance to learn from your mistakes and grow."
                },
                "finances":{
                    "keyword":["dishonesty","untrustworthy financial dealings","avoiding accountability","unfair financial outcomes"],
                    "detail":"Some dishonesty is present regarding your finances when the reversed Justice card appears in your reading. Be cautious about who you share your financial information with, and ensure that they can be trusted before going forward. If you’ve been having a hard time with your finances, the reversed Justice card can also signal failure to take accountability for your situation. Taking responsibility for a difficult situation can sound unpleasant, but it can also be empowering."
                },
                "feelings":{
                    "keyword":["imbalance","confusion","questioning intentions","past grievances","perceived injustices","self-doubt"],
                    "detail":"When the reversed Justice card appears in relation to how someone feels about you, it reveals a sense of imbalance and confusion in their emotions. They may feel that fairness has been compromised, leading them to question your intentions or the dynamics of your relationship. Their feelings are clouded by past grievances or perceived injustices, making it difficult for them to fully embrace what could be a positive connection.\n\nAs you navigate your own feelings, this card suggests that you might be grappling with self-doubt and uncertainty. You could be feeling as though things are not aligning as they should, prompting introspection about whether you've acted justly in this situation. This reflection can lead to deeper insights into both yourself and the relationship at hand, urging you to seek clarity before moving forward."
                },
                "actions":{
                    "keyword":["reassess situation","confront imbalances","seek accountability","engage in open conversations"],
                    "detail":"In the presence of the reversed Justice card, you’re encouraged to take a step back and reassess your current situation. It indicates a need for introspection regarding fairness and balance in your life. You may be overlooking important truths or avoiding accountability, so now is the time to confront any imbalances head-on. Consider journaling about areas where you feel wronged or have wronged others, allowing yourself to process these feelings honestly. Engage in open conversations with those affected by your decisions, seeking clarity and resolution. This period of reflection will help you realign with your values and restore harmony in both personal and professional relationships."
                },
                "yesno":{
                    "keyword":["maybe"],
                    "detail":"maybe"
                }
            }
        }
    },
    {
        "title": "The Hanged Man",
        "category": "major arcana",
        "summary": "The Hanged Man card reflects a particular need to suspend certain action. As a result, this might indicate a certain period of indecision.",
        "images": [
            {
                "deck": "Rider-Waite-Smith",
                "url": "https://steve-p.org/cards/pix/RWSa-T-12.png"
            }
        ],
         "meaning": {
            "upright": {
                "general":{
                    "keyword":["sacrifice","waiting","uncertainty","perspective","contemplation","indecision","pause","reflection"],
                    "detail":"The hanged man understands that his position is a sacrifice that he needed to make in order to progress forward - whether as repentance for past wrongdoings, or a calculated step backward to recalculate his path onward. This time he spends here will not be wasted, he does this as part of his progression forward. His upside down state can also symbolize the feeling of those that walk a spiritual path, for they see the world differently. Where there are others that do not understand the need to sacrifice, you see it differently. This is a natural course of action for you as you walk the path alone.\n\nThe Hanged Man card reflects a particular need to suspend certain action. As a result, this might indicate a certain period of indecision. This means that certain actions or decisions which need to be properly implemented are likely to be postponed even if there is an urgency to act at this particular moment. In fact, it would be ultimately the best if you are capable of stalling certain actions in order to ensure that you have more time to reflect on making critical decisions, this will ultimately be the best.\n\nThis is a card which is mainly designated towards waiting and suspension. This suggests that this might be the thing that you need to do in order to achieve success or to wait for the proper opportunity. Keep in mind that taking action is not always the best solution and in certain cases refraining from doing so might bring you just as much, if not more benefits."
                },
                "love":{
                    "keyword":["sacrifice for love","patience in romance","new perspectives on relationships","avoid romantic pressure"],
                    "detail":"In general, the Hanged Man is about sacrifice, new perspectives and waiting for the right time. For singles, the upright Hanged Man tarot love meaning indicates that things cannot be rushed. Regardless of how much you throw yourself into your romantic pursuits, or message your date all the right things, it may not be up to you if the other party isn’t ready. Instead of trying to force or pressure a relationship to come into fruition, use this time to see how your perspective changes when you’re alone. This same thing applies within relationships as well. Timing may be an issue when it comes to having important discussions, or taking your relationship to the next level.\n\nAlternatively, the concept of sacrifice may play an important role in your relationships, or potential relationships now. Help may be needed, and these can be moments in which your commitment is tested, but can also bring the two of you closer together."
                },
                "career":{
                    "keyword":["waiting","uncertainty about career","forced break","contemplating next steps","pause for reflection"],
                    "detail":"When it comes to work, the Hanged Man can signal a feeling of waiting or uncertainty about what you should be doing. Your projects may be on pause, forcing you to take a break, or you may be waiting and contemplating what your next move is. There is a lesson to this card, which is that sometimes, no matter what, you cannot force a decision, or changes to occur when things are not at the right time. At times, you need to just wait, and the things that you were pushing for so hard, whether it’s a response from a business partner or colleague, or a decision from a client, or a decision on what to change in your career, will come in time. Relax, and just be. Alternatively, you may be in the process of making a big change in your career. What looks like taking a step backward may be a calculated process to realign your path with something that is more fulfilling to you."
                },
                "finances":{
                    "keyword":["change in perspective","pause for reflection","opportunity from stress","re-evaluating finances"],
                    "detail":"The Hanged Man can signal that a change in perspective is needed. If there has been some stress about money matters, you may find that at the moment a pause can actually bring you a new way of looking at things. Can you turn a bad situation into an opportunity? Do things only seem worse than they really are?"
                },
                "feelings":{
                    "keyword":["contemplation","patience","introspection","sacrifice for love","uncertainty about feelings","new perspective"],
                    "detail":"When you pull The Hanged Man in response to how someone feels about you, it reveals a deep sense of contemplation and surrender. This person is introspective, taking their time to explore the depths of their emotions toward you. They’re experiencing a shift in perspective, understanding that love demands patience and sacrifice. Their feelings aren’t rushed; they’re allowing themselves to view things from different angles before making any decisions.\n\nAs for your own feelings, The Hanged Man indicates you're facing uncertainty or a need for pause. You might feel suspended between action and reflection, questioning what truly matters in this relationship. Embrace this stillness; it offers valuable insights into your desires and needs as you move forward."
                },
                "actions":{
                    "keyword":["pause for reflection","embrace stillness","reassess priorities","practice mindfulness","let go of old beliefs"],
                    "detail":"With The Hanged Man at the forefront, now is the time for you to pause and reassess your current situation. This card encourages you to adopt a new perspective, urging you to let go of old habits or beliefs that no longer serve you. In practical terms, consider taking a break from your usual routine; perhaps spend some time in meditation or journaling to gain clarity on what truly matters. Engage in activities that promote mindfulness, like yoga or nature walks, allowing yourself the space to reflect deeply. Embrace this period of stillness as an opportunity for personal growth and transformation."
                },
                "yesno":{
                    "keyword":["maybe"],
                    "detail":"maybe"
                }
            },
            "reverse": {
                "general":{
                    "keyword":["stalling","disinterest","stagnation","avoiding sacrifice","standstill","apathy","frustration","impatience"],
                    "detail":"The reversal meaning of the Hanged Man card represents a very specific period of time during which you feel as if you are sacrificing a significant amount of time while getting nothing in return. You might have felt as if certain things are at a state of an absolute standstill without any particular resolution or movement. It’s as if you are putting your entire effort and attention into something but nothing turns out as it should."
                },
                "love":{
                    "keyword":["stalling","disinterest","stagnation","avoiding sacrifice","apathy","frustration","impatience"],
                    "detail":"Now is the time for action. The reversed Hanged Man tarot love meaning suggests that the period of waiting is over. There may have been a slowdown in your love life recently, forcing you to take the time to consider different perspectives on romance and love. Ideally, you have re-emerged with a clearer understanding of what it is you expect from relationships. This may be a time when old, long held beliefs are being shed. With this new perspective, you are now equipped to take action or make changes in your romantic life with renewed energy. This card also can caution against making needless sacrifices for love. Make sure that your needs and your partner’s are balanced."
                },
                "career":{
                    "keyword":["stalling","disinterest","stagnation","avoiding sacrifice","procrastination","powerlessness"],
                    "detail":"When the Hanged Man is reversed, you may feel that the sacrifices you’ve been making in your career haven’t really been yielding results. If you’ve recently changed career paths, or have taken time off to go through retraining, or used your family time for work projects, things may not be going as planned. It may not feel as if making these changes have been worth it. At times, this card can also indicate stalling for time. Instead of waiting for the right moment, you may be at such a loss about what to do next that you’ve been procrastinating on making a decision that will propel you to your next steps, leading to a feeling of powerlessness or stagnancy. Don’t languish too long, learn to be an active participant in your life."
                },
                "finances":{
                    "keyword":["indecision","failed investment","wasted financial sacrifice","stalling for time","lack of returns"],
                    "detail":"If you’ve been contemplating a major purchase or investment of your resources lately, your indecision and hesitancy may mean that you never take the next step. Sometimes, this card can also indicate that your investments are not yielding any returns; this doesn’t have to be in traditional banking institutions. Perhaps you lent money for a family member’s education, only to have them drop out. Perhaps you’ve put some of your finances into a side-hustle, only for it to be a failure. There is a sense of wasted sacrifice with this card; let these be a lesson for how to approach these situations in the future."
                },
                "feelings":{
                    "keyword":["frustration","impatience","feeling stuck","questioning connection","conflicting feelings","desire for change"],
                    "detail":"The arrival of the reversed Hanged Man suggests a sense of frustration and impatience. This person may feel stuck or unable to move forward in their emotions, leading them to question the connection between you. They might be grappling with conflicting feelings, unsure whether to take action or remain passive.\n\nWith regard to your own feelings, this card suggests that you are experiencing a desire for change but may feel trapped by circumstances or indecision. You could be yearning for clarity and direction while wrestling with doubts that keep you from fully embracing your emotions. It’s essential now to reflect on what truly matters to you and seek ways to liberate yourself from any self-imposed limitations."
                },
                "actions":{
                    "keyword":["reassess situation","embrace change","let go of limiting beliefs","take small steps toward goals"],
                    "detail":"When you draw the reversed The Hanged Man, it’s a clear signal that change is on the horizon. You may have been feeling stuck or stagnant, but now is the moment to embrace change. Start by reassessing your current situation; identify what has been holding you back and let go of any limiting beliefs. Engage in activities that challenge your usual way of thinking, such as exploring new hobbies or seeking out diverse viewpoints through conversations with others. Prioritize taking small steps toward goals you've postponed, whether it's starting a project or making a necessary decision. Embrace this opportunity for growth and transformation."
                },
                "yesno":{
                    "keyword":["maybe"],
                    "detail":"maybe"
                }
            }
        }
    },
    {
        "title": "Death",
        "category": "major arcana",
        "summary": "The Death card signals that one major phase in your life is ending, and a new one is going to start.",
        "images": [
            {
                "deck": "Rider-Waite-Smith",
                "url": "https://steve-p.org/cards/pix/RWSa-T-13.png"
            }
        ],
        "meaning": {
            "upright": {
                "general":{
                    "keyword":["transformation","endings","change","transition","letting go","release","new beginnings"],
                    "detail":"Death is one of the most feared cards in a Tarot Deck, and it is very misunderstood. Many people avoid mentioning this card because it has that much power. Most times, people take the name of the card literally. However, the real meaning within the Death card is one of the most positive in the whole deck.\n\nThe Death card signals that one major phase in your life is ending, and a new one is going to start. You just need to close one door, so the new one will open. The past needs to be placed behind you, so you can focus your energy on what is ahead of you.\n\nAnother meaning is that you are going to go through a major change, transition, or transformation. The old version of you needs to ‘die’ to allow the new you to be created. This can be a scary time for you because you may be unsure of what will happen in the future. Even if you are scared, you should welcome the change because you are opening the door to new life events.\n\nDeath can also mean that you need to let go of any unhealthy attachments that you have in your life. This is an important part of life, so learning to keep moving forward is one of the lessons Death teaches us."
                },
                "love":{
                    "keyword":["relationship changes","emotional dynamics","ending unhealthy attachments","personal growth"],
                    "detail":"When it comes to love and relationships, the Death tarot card love meaning can indicate being stuck in emotional dynamics that are no longer working. If you are already in a relationship, for the relationship to continue, you must learn to embrace change. Sometimes, this card can also indicate that you may want to end the relationship, especially if it hasn't been going well. It is important to remember that all doors that close with the Death tarot card open another. While Death may be difficult to accept in a love tarot reading, transformations for one partner or another may be what is needed to help both individuals grow. It is also important to remember that the cards are suggestions, and that you have the choice to either accept and welcome your relationship's transformation, or let it go.\n\nWhile initially scary, the transformations that the Death tarot card can bring to love can also be positive. In less stressful terms, it can be the coming of a new era, such as an engagement.\n\nIf you are not in a relationship, the Death tarot card love meaning can instead point to beliefs, attitudes or behaviors that you are currently shedding that can help you develop healthier, stronger relationships."
                },
                "career":{
                    "keyword":["job transition","career change","embracing new opportunities","leaving unfulfilling work","personal growth"],
                    "detail":"If you’ve been considering a career change, the upright Death card can be a signal that you should take the plunge and act now. You may have been through a period of apathy, disinterest and frustration at your current job, and should you not take decisive action, events in life may force you to make a change. You may be clinging to your current path because it offers stability, certainty and safety, but if you are otherwise unhappy or feeling unchallenged, there is much more to lose than your comfort. Often when one door closes, another one opens; embrace the shifts occurring right now and dive in."
                },
                "finances":{
                    "keyword":["financial loss","adapting to financial loss","changing views of money","transformation in finances"],
                    "detail":"Loss is signaled by the Death tarot card, meaning that you may unfortunately be dealing with a loss in your financial resources. This period can also be the initiator to a transformation in how you handle your relationship to your money and what you value. The lessons you learn from this time can lead to practical changes when it comes to managing your resources, as well as to spiritual changes in knowing what is truly important to you."
                },
                "feelings":{
                    "keyword":["transformation","renewal","embracing change","letting go of past patterns","openness to new possibilities"],
                    "detail":"The upright Death card signals a powerful moment of transformation and renewal. This person senses that your connection is evolving; they feel the end of old patterns and are open to new possibilities with you. Their emotions run deep as they recognize the need for change and growth within themselves, which can strengthen your bond if nurtured.\n\nYour own feelings mirror this shift. The upright Death card reveals that you, too, are experiencing significant personal changes. You may be ready to shed past baggage or emotional ties that no longer serve you. Embrace this transformative energy; it urges you to let go of what holds you back and welcome fresh beginnings in both love and life."
                },
                "actions":{
                    "keyword":["embrace transformation","let go of unhealthy attachments","confront fears","engage in new experiences"],
                    "detail":"When you draw the upright Death card, you’re being asked to embrace transformation and release what no longer serves you. This is a powerful moment for letting go of old habits, relationships, or mindsets that hinder your growth. Consider decluttering your space as a physical manifestation of this change; donate items that hold emotional weight but no longer resonate with who you are becoming. Additionally, reflect on areas in your life where fear may be holding you back. Perhaps it’s time to confront those fears head-on. Engage in new experiences that challenge your comfort zone, allowing yourself to evolve into the person you're meant to be."
                },
                "yesno":{
                    "keyword":["no"],
                    "detail":"no"
                }
            },
            "reverse": {
                "general":{
                    "keyword":["fear of change","repeating negative patterns","resisting change","stagnancy","decay","feeling stuck"],
                    "detail":"The Death reversal meaning is still about change, but that you have been resisting it. You could be worried about letting go of the past, or you could not be sure of the changes that you need to make to go forward. Resisting the change and holding onto the past can limit your future, which can cause you to feel like you are in limbo. You should take some time to assess the ways that you have been approaching changes in your life. You may find you have been halting the changes that you need due to fears of the unknown. While you can still be afraid, you should trust that you are taking the right steps and move forward. Life moves on, so fighting passing time is only going to leave you with regrets. Death does not have to be a card of regret, especially if you heed its warning."
                },
                "love":{
                    "keyword":["resisting relationship change","stagnant relationship","fear of being alone","negative emotional patterns"],
                    "detail":"The Death tarot card love meaning in reverse can signal strong resistance to change when it comes to your approach and attitude to relationships and romance. This can come in the form of hanging onto a relationship that is stagnant and no longer helping either of you grow as individuals. There may also be dependence on the relationship, or you may only remain together because you feel comfortable, obligated or scared of being alone.\n\nOn the other hand, old relationships can also be revived. If you are single, Death reversed in a love tarot reading can suggest that you must avoid negative patterns and dynamics to be able to truly engage in a loving relationship. You may have self-esteem issues, savior complexes, or wounds that you need to heal in order to find a partner that will love and respect you, and one you can love and respect in return."
                },
                "career":{
                    "keyword":["resisting change","repeating negative patterns at work","remaining in unfulfilling job","lack of growth"],
                    "detail":"As with this card’s upright version, you are being pushed to a change when it comes to your job or your career path. But in reverse, you may be doing all you can to resist this transition. You may stick around despite the unhealthy environment, the reduced pay, or the monotonous projects. Change is inevitable; this applies to our career as well as other aspects of our lives. We must learn to welcome it instead of pushing it away. When we cling to a cycle that is no longer meant to remain in our lives, we watch it slowly decay and drain us. At times, this card can also represent negative patterns repeating once again in your workplace. Do you self-sabotage? Does your defensiveness when making mistakes create trouble? Does your impostor syndrome affect how you interact with your colleagues? Consider what must be let go for you to release these unhealthy patterns."
                },
                "finances":{
                    "keyword":["failure to adapt","unhealthy financial habits","resisting change in finances","fear of loss"],
                    "detail":"A loss of financial resources may be unavoidable, but this may be hard for you to accept and adapt to. You may have to make some shifts when it comes to your expenses in order to make it through this temporary period, but you may find it hard to give up some things that you consider needs. Instead of allowing this time to change how you relate to your resources and what your values are, you may not be learning your lessons. Learn to stop resisting these changes, and you may have a much easier time coping."
                },
                "feelings":{
                    "keyword":["fear of change","feeling stuck","resisting growth","confusion about feelings","apprehensive about future"],
                    "detail":"When you draw the reversed Death card in a reading about how someone feels about you, it suggests that this person is grappling with resistance to change and transformation. They may feel stuck or hesitant, struggling to let go of past experiences that influence their perception of you. This could indicate lingering doubts or fears that prevent them from fully embracing their feelings for you, leaving them in a state of confusion.\n\nWith regard to your own emotions, the reversed Death card reflects an internal struggle as well. You might be feeling apprehensive about moving forward or letting go of old patterns that no longer serve you. There’s a sense of stagnation where growth seems daunting, yet deep down, there’s a yearning for renewal and clarity. Embrace this moment as an opportunity to confront what holds you back and consider how releasing these attachments can lead to personal evolution and deeper connections with others."
                },
                "actions":{
                    "keyword":["resist change","confront fears","let go of toxic relationships","embrace new experiences"],
                    "detail":"When you draw the reversed Death card, it signals a struggle against necessary change or transformation. It’s time to embrace what needs to end in your life, whether it’s an unfulfilling job, a toxic relationship, or outdated beliefs. Acknowledge these areas and take actionable steps toward letting go. Start by journaling about what no longer serves you and create a plan for moving forward. Seek out new experiences that challenge your comfort zone; this could mean taking up a new hobby or meeting different people who inspire growth. Embrace the idea that endings can lead to fresh beginnings, allowing yourself to evolve into who you truly want to be."
                },
                "yesno":{
                    "keyword":["yes,but"],
                    "detail":"yes,but"
                }
            }
        }
    },
    {
        "title": "Temperance",
        "category": "major arcana",
        "summary": "The Temperance tarot card suggests moderation and balance, coupled with a lot of patience.",
        "images": [
            {
                "deck": "Rider-Waite-Smith",
                "url": "https://steve-p.org/cards/pix/RWSa-T-14.png"
            }
        ],
        "meaning": {
            "upright": {
                "general":{
                    "keyword":["balance","peace","patience","moderation","calm","tranquillity","harmony","serenity"],
                    "detail":"In moments where there is anxiety or great stress, you have been able to remain calm throughout. You are a person who has mastered the art of not letting things get to you, and this allows you to achieve much progress in all areas you seek out to explore. The Temperance tarot card suggests moderation and balance, coupled with a lot of patience. Where this card appears, there is the suggestion that extremity in any situation is to be avoided.\n\nThe Temperance card implies that you have a clear vision and know what you want to achieve. This is an indication of higher learning, which is a critical attribute in the journey of life. It reflects that you have found peace with what you are doing and everything is unfolding as it ought to. The Temperance card, in relation to other people, shows that you are able to adapt and work in harmony with your community, your coworkers and your loved ones. Your calmness in all matters gives them comfort and puts them at ease.\n\nTemperance may also indicate a time to evaluate and re-examine the priorities you have chosen. This will help you create a balance between your outer and inner self. At the end of it all, you will find greater purpose and meaning in your actions, for her message is that we cannot live fully in either."
                },
                "love":{
                    "keyword":["patience","moderation","understanding","balance","harmony","careful love","thoughtful actions"],
                    "detail":"In romance, the upright Temperance tarot love meaning suggests patience, moderation, understanding and going the middle path. This card indicates that we must avoid going to extremes, and to be cautious and thoughtful of our actions. Consider your actions when it comes to love; and in what aspects your attitudes, beliefs or thoughts can be excessive. Are you too pushy with potential partners? Or instead, are you too reserved? Are you too giving? Or are you not giving enough? How can you bring these traits into balance? In addition, your relationship or potential relationships may require some patience right now, and attempt to work together to find compromise and harmony."
                },
                "career":{
                    "keyword":["patience","moderation","steady progress","calmness at work","balance in career","emotional navigation"],
                    "detail":"Patience and moderation may be helpful tools for you to achieve your career goals. You are likely to find what you desire when it comes to your work, but it may come slowly and quietly as you put in the work every day. Your dedication and ability to navigate emotionally charged situations at work with calm can help you be noticed by your peers and superiors. When it comes to making changes in your career path, the Temperance card can be a reminder to remain patient, steady and devoted; all good things take time. Temperance can also signal doing a good job in balancing your career with different aspects of your life; it is neither an all consuming ambition or just a paycheck to you."
                },
                "finances":{
                    "keyword":["diligent saving","steady growth","moderation in spending","balance in finances","treating yourself occasionally"],
                    "detail":"The Temperance card can be a call to make sure that your approach to your finances is one of moderation and balance. This can mean that you’ve been diligent with saving, while also being able to treat yourself with something you can afford every once in a while. Over time, you may be building your resources with steady, diligent saving."
                },
                "feelings":{
                    "keyword":["balance","peace","patience","calm","harmony","understanding","appreciation","moderation","connection"],
                    "detail":"The upright Temperance card reveals a deep sense of balance and harmony in their feelings for you. They appreciate your presence, sensing a natural flow between you two that hints at potential growth and mutual understanding. Their emotions are rooted in patience and moderation, showing they value the connection without rushing into anything impulsive.\n\nIn terms of your own feelings, Temperance urges you to find equilibrium within yourself. You may crave peace and stability as you navigate your emotions. This card encourages you to blend different aspects of your life harmoniously, prompting reflection on what truly brings you joy while keeping an open heart toward the possibilities this relationship holds."
                },
                "actions":{
                    "keyword":["balance different aspects","practice patience","reassess priorities","cultivate inner peace","engage in collaboration"],
                    "detail":"With Temperance in your hands, it’s time to embrace balance and moderation in your life. You should focus on harmonizing different aspects of your existence, whether it’s work-life balance or emotional equilibrium. This may involve reassessing your daily routines to ensure they align with your values and goals. Consider incorporating mindfulness practices like meditation or yoga to cultivate inner peace. Additionally, engage in activities that promote collaboration rather than competition, fostering connections with others while maintaining healthy boundaries. Embrace patience as you blend various elements of your life into a cohesive whole, allowing for growth and transformation."
                },
                "yesno":{
                    "keyword":["yes"],
                    "detail":"yes"
                }
            },
            "reverse": {
                "general":{
                    "keyword":["imbalance","excess","extremes","discord","recklessness","hastiness","impatience","frustration"],
                    "detail":"Temperance in reversed is a reflection of something that is out of balance and may be causing stress and anxiety. The real meaning of the Temperance card can be deciphered using the other cards in the spread to identify areas where this imbalance is being caused. A Temperance in reversal may also be used as a warning; if you take a certain path, it would lead to turbulence and excess.\n\nLack of a long-term plan or vision may also be the Temperance reversal meaning. This creates a lack of purpose for you, leaving you feeling lopsided as you search here and there for what you should be doing. You must reflect and think carefully about what needs to change. Temperance reminds us that all things are only good in moderation, and that we must examine in which aspects of our lives we are breaking the balance."
                },
                "love":{
                    "keyword":["imbalance","extremes","impatience","all or nothing love","emotional turmoil","lack of harmony"],
                    "detail":"In love, do you tend to think in all or nothing terms? Love, like many things in life, are full of grey areas. When reversed Temperance appears in a love tarot reading, your intensity may be surprising right now. Sometimes, no matter our best efforts, we can’t force love to come into being. You may benefit from being a bit more patient, while also making sure that your own emotions or desires do not go into extremes. When your date does something that is displeasing to you, do you tend to immediately reject them? Are you too demanding on your potential partners, so that nobody ever can satisfy you? It’s important to remember that humans can never be perfect; make sure your desires are reasonable."
                },
                "career":{
                    "keyword":["work-life imbalance","all or nothing at job","rushed job","reckless decisions","lack of long-term vision"],
                    "detail":"Something at work may be suffering from a lack of balance right now. Do you tend to go all in when it comes to your work, so much so that other aspects of your life suffer? Are you always pulling all-nighters, hoping that it all pays off in the end? Or alternatively, do you find that you slack off, leading to resentment from your colleagues? While the former can bring you success, this can be damaging to you in the long term. If this applies to you, look to correct this imbalance. Ensure that when completing projects, you aren’t rushing through them or making reckless choices; the quality of your work may be suffering."
                },
                "finances":{
                    "keyword":["imbalance","excess spending","reckless decisions","lack of financial planning","short-term gratification"],
                    "detail":"Are you someone who always needs to buy yourself the next nice luxury? Or alternatively are you so frugal that you never reward your hard efforts with any small treat? It’s likely that both of these attitudes will need adjustment, as they are both untenable in the long term. The first always puts instant gratification over your future comfort, and vice versa. Consider your financial goals, and make sure you also put your own well-being in the picture; both your future well-being, and your present well-being needs to find a comfortable middle ground."
                },
                "feelings":{
                    "keyword":["overwhelmed","conflicted","frustration","impatience","lack of harmony","emotional turmoil","uncertainty"],
                    "detail":"The appearance of the reversed Temperance card in relation to how someone feels about you points to a sense of imbalance and disharmony in their emotions. They may feel overwhelmed or conflicted, struggling to find a middle ground between their feelings for you and other aspects of their life. This could indicate that they are experiencing frustration or impatience, perhaps feeling that the connection lacks the harmony they desire.\n\nIn terms of your own feelings, this card reflects a similar struggle within yourself. You might be grappling with inner turmoil or uncertainty about what you truly want from this relationship. There is a chance that you're feeling disconnected from your own needs and desires, leading to confusion about how to move forward. It’s essential now to take time for self-reflection and seek balance within before making any decisions regarding this emotional landscape."
                },
                "actions":{
                    "keyword":["confront imbalance","set boundaries","prioritize self-care","explore new hobbies","cultivate inner peace"],
                    "detail":"With Temperance in reverse, it’s time to take a hard look at your life’s balance and harmony. It may be time to confront areas where you feel out of sync, whether it’s in relationships, work, or personal habits. Focus on integrating different aspects of your life rather than letting them clash. Take action by setting boundaries with others, prioritizing self-care routines like meditation or exercise, and exploring new hobbies that bring joy. Embrace a mindset shift; instead of seeking external validation, cultivate inner peace through mindfulness practices. This is your moment to realign with what truly nourishes your spirit."
                },
                "yesno":{
                    "keyword":["no"],
                    "detail":"no"
                }
            }
        }
    },
    {
        "title": "The Devil",
        "category": "major arcana",
        "summary": "Addiction to substances or material pleasures can also be the reason for your feelings of powerlessness and entrapment.",
        "images": [
            {
                "deck": "Rider-Waite-Smith",
                "url": "https://steve-p.org/cards/pix/RWSa-T-15.png"
            }
        ],
        "meaning": {
            "upright": {
                "general":{
                    "keyword":["oppression","addiction","obsession","dependency","excess","powerlessness","limitations","entrapment"],
                    "detail":"Getting the devil card in your reading shows that you have feelings of entrapment, emptiness and lack of fulfillment in your life. It might also mean that you are a slave to materialism and opulence and no matter how hard you try, you just can’t seem to shake off the feeling of wanting to indulge in luxurious living.\n\nYou might be aware that this kind of lifestyle is leading you down the rabbit hole, but you have that feeling of not having any form of control over your actions or urges.\n\nAddiction to substances or material pleasures can also be the reason for your feelings of powerlessness and entrapment. In situations such as these, you may feel as though you are a slave, unable to control your impulses or willpower to direct yourself towards something other than the satisfaction of these desires."
                },
                "love":{
                    "keyword":["lust","temptation","hedonism","selfishness","obsession","codependency","communication","indulgence"],
                    "detail":"Lust and temptation are symbolized by the Devil in a love tarot reading. There can be a sense of hedonism, and a selfish desire for gratification with this card. In less serious circumstances, it can also just simply mean a pursuit for all of life’s earthly pleasures. There is nothing wrong in having a bit of fun, but make sure that you are not hurting others or giving them wrong impressions when you do. If you’re only looking for hook-ups, it is up to you to communicate that with your dates. Make sure you avoid pressuring others if they decide your lifestyle isn’t something that suits them. Communication will be more important than ever now.\n\nAlternatively, the Devil tarot love meaning can also signal addiction, and in the context of love and relationships, co-dependency. Over time, this can be destructive to the individuality and self of both partners. Be wary, and ensure that the two of you remain strong individuals within your relationship."
                },
                "career":{
                    "keyword":["feeling trapped in job","blaming colleagues","self-sabotage","lack of fulfillment","dependency on work"],
                    "detail":"You may feel stuck or trapped when it comes to your career right now, like you don’t have any options but to stay somewhere that you dislike. In this state, it may be easier to blame your circumstances, bad luck, or a host of external factors. You may feel dependent on this job, without the power to make the changes that would bring you happiness. At times, this card can also signal self-sabotage and playing the victim when it comes to work relations with your colleagues. Regardless of what it feels like, the Devil’s appearance can signal that you have more choices than you think you do, you only need to reclaim your power. This can be scary, to take accountability for a situation that you dislike, but it can also be empowering."
                },
                "finances":{
                    "keyword":["bad financial habits","compulsive spending","gambling","lack of control over finances","material dependency"],
                    "detail":"Difficult financial situations may be exaggerated with bad habits with the Devil in the reading. This can signal that there is often more that you can do to bring yourself out of this state, but you may be either failing to see the solutions, or you are unable to change the way that you handle your finances. You may be spending compulsively, gambling, or unable to take control of your material resources. Make sure you are doing all that you can."
                },
                "feelings":{
                    "keyword":["intense attraction","possessiveness","obsession","dependency","insecurity","desire","temptation"],
                    "detail":"The arrival of The Devil reveals a captivating yet tumultuous emotional landscape regarding someone's feelings for you. This person is intensely drawn to you, their attraction bordering on possessiveness. They are captivated by your energy but also wrestle with insecurities and unhealthy attachments. Their emotions run deep, teetering between desire and dependency.\n\nOn your end, The Devil suggests you're grappling with temptation or feeling trapped in certain patterns. You might feel pulled toward indulgence or distraction instead of confronting deeper issues within yourself. It's crucial to acknowledge these feelings and assess whether they uplift you or keep you stuck in unproductive cycles."
                },
                "actions":{
                    "keyword":["confront unhealthy habits","set boundaries","reevaluate relationships","embrace self-awareness","seek joy"],
                    "detail":"In the presence of The Devil, you are called to confront the chains that bind you. This card urges you to recognize any unhealthy habits or toxic relationships in your life and take decisive action to break free from them. It’s time to embrace personal responsibility and acknowledge where you've given away your power. Consider setting boundaries with those who drain your energy, or reevaluating addictive behaviors that hold you back. Engage in activities that promote self-awareness, such as journaling or meditation, allowing yourself to explore what truly brings you joy and fulfillment beyond superficial desires. Embrace this opportunity for liberation and transformation."
                },
                "yesno":{
                    "keyword":["no"],
                    "detail":"no"
                }
            },
            "reverse": {
                "general":{
                    "keyword":["independence","freedom","revelation","release","reclaiming power","reclaiming control"],
                    "detail":"The upside down meaning of the Devil card can be the moment when an individual becomes self-aware and breaks all of the chains that come with addiction and poor habits. It might be because they are tired of running in circles and are in need of change.\n\nBut one thing is usually clear – breaking off these chains, especially those of addiction is never easy. So, one has to be prepared to make the necessary changes that might initially seem painful to make the adjustments that will pay off in the end by being able to find your true self again.\n\nSelf-assessment is called for in this case and the individual needs to take some time and list all of the things that they need to get rid of. And once that has been done, and then it would be time for them to embark on the difficult journey of self-improvement."
                },
                "love":{
                    "keyword":["emotional independence","ending co-dependency","reclaiming control","healthier relationships"],
                    "detail":"The reversed Devil tarot love meaning can signal that you may be breaking free from some negative emotional patterns or addictions that have stood in the way of you developing strong relationships. You may feel more in control of your love life than ever. This card in some circumstances can also signal breaking away from a relationship with a domineering partner, or a co-dependent relationship that was not allowing you to express your true self. You may have recognized that the bonds that tied you to your partner were ones that were not healthy or supportive. Continue to nurture your own independence and be proud of what you have done."
                },
                "career":{
                    "keyword":["independence","freedom","accountability","empowerment","reclaiming power","making changes"],
                    "detail":"When it comes to work, you are in the process of reclaiming your accountability in your career choices, and are in the process of making some much needed changes to avoid future issues. If you’ve been in a position that you’ve found stifling, you may be taking action; whether that means leaving an unfulfilling job, or an unhealthy environment, or choosing to fix a strained relationship with a colleague. You may no longer feel dependent on your job for a sense of stability, understanding that you can find it within yourself. Take note of the changes that occur when you rediscover your independence."
                },
                "finances":{
                    "keyword":["breaking bad financial habits","feeling independent financially","retaking control of finances"],
                    "detail":"If you’ve had a history of bad financial habits, you may be working on making the changes necessary for you to retake control. If you’ve been dependent on others for your material resources, like a partner, or family members, you may be enjoying a new sense of independence."
                },
                "feelings":{
                    "keyword":["liberation","clarity","breaking free","genuine connection","empowerment","healthier choices","self-awareness"],
                    "detail":"When the reversed Devil appears, it reveals a sense of liberation and newfound clarity in how this person feels about you. They may be breaking free from past attachments or unhealthy patterns that once clouded their judgment, leading them to see your relationship with fresh eyes. This shift indicates they are beginning to recognize the potential for genuine connection rather than being trapped by fear or temptation.\n\nThe arrival of the reversed Devil suggests you're experiencing a release from any self-imposed limitations or toxic influences. You might feel empowered and ready to embrace healthier choices in your emotional life. This card encourages you to reflect on what truly brings you joy and fulfillment, allowing yourself to move forward without the weight of past burdens holding you back."
                },
                "actions":{
                    "keyword":["break free from unhealthy attachments","identify limiting beliefs","set boundaries","prioritize self-discipline"],
                    "detail":"In the realm of personal growth, drawing the reversed The Devil suggests that now is the time to break free from unhealthy attachments and limiting beliefs. You should focus on identifying what holds you back, whether it’s toxic relationships, bad habits, or negative thought patterns. This card encourages you to take actionable steps toward liberation; consider journaling your thoughts to uncover hidden fears or seeking support from a trusted friend or therapist. When you embrace self-discipline by setting boundaries in your life and prioritizing activities that nourish your spirit, you're taking significant strides forward. By confronting these challenges head-on, you can reclaim your power and create a more authentic path forward."
                },
                "yesno":{
                    "keyword":["no"],
                    "detail":"no"
                }
            }
        }
    },
    {
        "title": "The Tower",
        "category": "major arcana",
        "summary":"The old ways are no longer useful, and you must find another set of beliefs, values and processes to take their place.",
        "images": [
            {
                "deck": "Rider-Waite-Smith",
                "url": "https://steve-p.org/cards/pix/RWSa-T-16.png"
            }
        ],
        "meaning": {
            "upright": {
                "general":{
                    "keyword":["disaster","destruction","upheaval","trauma","sudden change","chaos","foundational shift","radical transformation"],
                    "detail":"The Tower represents change in the most radical and momentous sense. It is for this reason that the card itself visually looks so unnerving. But it doesn't necessarily have to be truly frightening or ominous. Because at the heart of this card, its message is foundational, groundbreaking change.\n\nThe kind of event that the Tower card marks does not have to be something terrible, like a disaster or a great loss. Change itself is a normal part of life that one has to embrace. But it can sometimes strike fear, for it means that we must abandon the truths that we have known prior to this event. The old ways are no longer useful, and you must find another set of beliefs, values and processes to take their place.\n\nBe positive, it is time for you to replace the old foundations of the past with something that is more genuine and will serve you better in what is to come.\n\nIn terms of work, there is an inevitable argument bound to happen. You need to be in control and keep your temper in check. Avoid saying something that may hurt other people. When it comes to your love life, your romantic relationship may be nearing its end. Take this as a warning - if you really value your relationship, then it is time for you to take damage control or open a communication to clear misunderstandings. In your finances, the tower meaning refers to the need to be assured on your transactions."
                },
                "love":{
                    "keyword":["breakup","weak relationships ending","foundational shift in view of love","transformative change"],
                    "detail":"The Tower tarot love meaning signals great fundamental changes. Relationships that have weak or crumbling foundations won’t last much longer, and may collapse. While initially painful, these clear the way for new experiences. Perhaps your relationship was incredibly important to your identity; you took pride in being a good partner or parent, making you stay even while you may have otherwise been unhappy. While these times may be trying, know that they will pass. Should you be single, it may not be a relationship that is being broken down, but your perspective and understanding of the entire notion of what love means to you. What beliefs about love are not serving your highest self? These need to be transformed so you can develop an individual understanding of what your needs are when it comes to relationships."
                },
                "career":{
                    "keyword":["sudden job loss","workplace disruption","increased responsibility","chaos at work","stress in career"],
                    "detail":"There can be a lot of stress right now when it comes to your career; the Tower can signify a sudden job loss, or the attainment of a new position that creates chaos due to sudden increases in responsibility. Something from the outside environment, like a new boss, or the loss of a colleague could mean disasters happening in the workplace. It is important to remember that at this time, though things are frustrating, that it is possible for these temporary messes to lead to a better long term future, such as a job that suits you better, or a more peaceful workplace in the long term."
                },
                "finances":{
                    "keyword":["financial loss","wake up call regarding finances","sudden loss of resources","need for savings"],
                    "detail":"It would be wise for you to make sure you have some funds put away right now. The Tower in its worst case scenario speaks of disaster, and in finances it is no different. There may be unwelcome surprises in store that can create a sudden loss of resources. These scenarios can serve as wake up calls; develop a resilient support system, and tend to the things that truly matter to you."
                },
                "feelings":{
                    "keyword":["overwhelmed by feelings","confusion about connection","need for reevaluation","transformative emotions"],
                    "detail":"When you draw The Tower in response to how someone feels about you, it reveals a storm of emotions. This person may feel overwhelmed by the intensity of their feelings, leading to confusion and uncertainty. They might see your connection as both disruptive and transformative, sparking an urgent need to reevaluate their life choices and emotional landscape.\n\nRegarding your own feelings, The Tower indicates inner turmoil. You could be facing sudden realizations that challenge everything you thought you knew about love and relationships. Embrace this chaos as a chance for growth; confront your fears and insecurities directly, knowing that this moment can lead to profound personal transformation."
                },
                "actions":{
                    "keyword":["embrace change","reassess situation","declutter space","end toxic relationships","pursue new career path"],
                    "detail":"As The Tower reveals itself, now is the time for radical change and transformation. Embrace this upheaval as an opportunity to break free from old patterns that no longer serve you. Start by reassessing your current situation; identify what feels stagnant or oppressive in your life. Take bold actions, such as decluttering your space, ending toxic relationships, or pursuing a new career path that excites you. Allow yourself to see challenges as catalysts for growth rather than obstacles. By embracing uncertainty and being open to new perspectives, you can rebuild a stronger foundation for your future filled with authenticity and purpose."
                },
                "yesno":{
                    "keyword":["no"],
                    "detail":"no"
                }
            },
            "reverse": {
                "general":{
                    "keyword":["avoiding change","resisting growth","clinging to the past","fear of transformation","denial of reality"],
                    "detail":"When you get the Tower card reversed, you can feel some crisis looming along the horizon, and you are struggling as much as you can to try and avoid its manifestation. What you have not realized is that these breakdowns can be beneficial in breaking down your reliance on something that is false. The tower is built on faulty foundations, and it must fall. Though the destruction will be painful, the humbleness resulting from it can bring us peace.\n\nWhat you relied on will no longer be there for you. Do not take this as a drastic and depressing change, it is time for you to become more self-reliant."
                },
                "love":{
                    "keyword":["making adjustment in love","leaving weak relationship","addressing resentments","preventing problems"],
                    "detail":"Change is never an easy thing to accept, but regardless of how much we resist it, it will come. If you see any problems in your relationship looming in the distance, this is your chance to deal with them now. Doing so may prevent bigger problems later. Are your resentments building up? What have you been keeping quiet because you think it’s not worth arguing over? Slowly, these things may turn into big issues that can uproot an otherwise happy relationship. Sometimes, this card can also signal that you may be ready to leave a relationship that has not been working."
                },
                "career":{
                    "keyword":["surviving layoffs","avoiding risks in career","feeling unfulfilled at work","resisting change"],
                    "detail":"Despite stressful situations at work, you may have been able to pull through. For example, if your workplace has gone through a series of layoffs or redundancies, you may find yourself amongst one of the lucky few that have managed to keep your job. This may come as a relief, or alternatively, can keep you from finding true fulfillment in your career. Sometimes, the Tower is the card that we all need to kick us out of our own stupor, and be motivated to leave the comfort of a monotonous job. This may be the chance you needed to open your eyes to what else could be awaiting you."
                },
                "finances":{
                    "keyword":["surviving financial disaster","avoiding bankruptcy","repeating financial troubles","managing debt"],
                    "detail":"If you’ve managed to successfully navigate yourself out of financial ruin, take the time to find a bit of relief. However, the Tower suggests that it may be better to accept that this needs to happen for you to move on. For example, if you’ve avoided bankruptcy by a hair by managing to pay off your debt for this month, it may be easier and healthier in the long run to accept your situation and declare bankruptcy. Or if you’ve purchased a home you can’t afford, and the mortgage payments are putting you underwater, it may be wiser for you to sell. Otherwise, one disaster is avoided, only to be restarted again next time; you may continue to have to struggle indefinitely. Consider what will ease your burden right now, and face the situation with a brave face."
                },
                "feelings":{
                    "keyword":["conflicted emotions","fear of change","desire for stability","seeking clarity","navigating chaos"],
                    "detail":"The arrival of the reversed Tower card suggests that this person is experiencing a sense of upheaval but is beginning to find clarity. They may feel shaken by past events or misunderstandings between you, yet there’s an underlying desire to rebuild and reconnect. Their emotions are complex; they might be grappling with fear of change while also yearning for stability and understanding.\n\nIn the realm of your own feelings, the reversed Tower indicates that you are navigating through your own emotional chaos but are starting to see the light at the end of the tunnel. You may feel relief from previous turmoil and recognize that transformation can lead to growth. This awareness encourages you to embrace change rather than resist it, allowing both yourself and this other person a chance at renewal in your connection."
                },
                "actions":{
                    "keyword":["rebuild foundations","embrace change","declutter space","reflect on past upheavals"],
                    "detail":"When you draw the reversed The Tower, it’s a signal that now is a time for rebuilding and reassessing your foundations. Instead of resisting change, embrace it as an opportunity to grow. Focus on identifying areas in your life where chaos has led to stagnation or fear. Take practical steps like decluttering your living space, which can symbolize clearing out old beliefs and habits that no longer serve you. Engage in open conversations with those around you to address misunderstandings or conflicts, fostering deeper connections. This period calls for reflection; journal about what you've learned from past upheavals and how they can guide your future choices."
                },
                "yesno":{
                    "keyword":["no"],
                    "detail":"no"
                }
            }
        }
    },
    {
        "title": "The Star",
        "category": "major arcana",
        "summary":"To see this card is a message to have faith, for the universe will bless you and bring forth all that you need.",
        "images": [
            {
                "deck": "Rider-Waite-Smith",
                "url": "https://steve-p.org/cards/pix/RWSa-T-17.png"
            }
        ],
        "meaning": {
            "upright": {
                "general":{
                    "keyword":["hope","inspiration","positivity","faith","renewal","healing","rejuvenation","resilience","inner strength"],
                    "detail":"The Star brings hope, renewed power, and strength to carry on with life. It shows how abundantly blessed you are by the universe as evidenced by the various things around you. It may not be directly evident at the moment, for this card follows the trauma of the Tower card. Remember that you hold within you all that you need for your fulfillment - the only thing that you need is courage. For this, you have all reasons to rejoice. To see this card is a message to have faith, for the universe will bless you and bring forth all that you need.\n\nTo receive the Star in your reading means that you have gone and passed through a terrible life challenge. You have managed to go through this without losing your hope. While you suffered, you perhaps were not aware of your own strength, but you are now perhaps recognizing that the loss helped you discover your own resilience and inner power. It is only now that you can really appreciate all that you have."
                },
                "love":{
                    "keyword":["hope in love","optimism about romance","healing from past wounds","rebuilding confidence","potential for closeness"],
                    "detail":"Lots of hope in love and romance is signaled by the Star tarot love meaning. It’s likely that your sense of hope and optimism can be a powerful magnet for you right now, giving you a sense of charisma and charm. If you have been healing from a break up, this card suggests that you are well on your way, and you are slowly rebuilding your confidence so that you can move on. If your relationship has been going through a rough patch, this also may be a time of healing. So long as the two of you remain communicative and honest with one another, there is great potential for bringing the two of you closer together."
                },
                "career":{
                    "keyword":["positivity brings career rewards","high hopes about job","faith in ambitions","healing from work stress"],
                    "detail":"When it comes to work, remain faithful that your ambitions will be achieved. This can give you great positivity that others will notice, and can bring you the opportunities that you hoped for. Should you be searching for a new job or a promotion, the star is a reminder to keep your hopes high. If you’ve gone through a difficult or stressful time at work recently, the Star also signals a period of healing. This should be a quiet and peaceful time as you recuperate."
                },
                "finances":{
                    "keyword":["reaching financial goals","remaining inspired","faith in financial future","positivity towards finances"],
                    "detail":"When it comes to your finances, the Star signals that one’s faith and positivity should help you reach your financial goals. While you put in the work towards your financial future, also make sure to take the time to appreciate and be grateful for what you already have, as that can be inspiration for you to continue along this path."
                },
                "feelings":{
                    "keyword":["hope","inspiration","positivity","faith","renewal","healing","uplifted","connection","optimism"],
                    "detail":"The Star reveals a moment of reflection on how someone feels about you, highlighting the hope and inspiration they associate with your presence. This person views you as a guiding light, brimming with potential and positivity. Your energy uplifts them, creating a bond that transcends ordinary connections. Their feelings are steeped in optimism, envisioning a bright future together.\n\nOn your end, The Star signifies healing and renewal. You’re aligning more closely with your true self and opening up to new possibilities. Embrace this clarity and trust the journey ahead; brighter days await if you stay hopeful and receptive to life’s offerings."
                },
                "actions":{
                    "keyword":["embrace hope","nurture dreams","engage in creative pursuits","practice gratitude","reach out for support"],
                    "detail":"In the presence of The Star, now is the time to embrace hope and renewal in your life. You should focus on nurturing your dreams and aspirations, allowing yourself to envision a brighter future. This may involve setting aside time for creative pursuits or engaging in activities that inspire you, such as painting, writing, or exploring nature. Additionally, consider reaching out to someone who uplifts you; sharing your visions can amplify their power. Practicing gratitude daily will help shift your perspective towards positivity and abundance. Trust in the process of healing and growth; take small steps toward manifesting what truly resonates with your soul."
                },
                "yesno":{
                    "keyword":["yes"],
                    "detail":"yes"
                }
            },
            "reverse": {
                "general":{
                    "keyword":["hopelessness","despair","negativity","lack of faith","self-doubt","disillusionment","pessimism about love"],
                    "detail":"When the Star card is reversed, it means that you are feeling as though everything has turned against you. The challenges that you would normally see as exciting seem instead to make you feel as though you cannot overcome them. You have lost faith in something, whether inside yourself or with something you normally find dear.\n\nWithout hope, without faith, we cannot find the motivation to progress forward in the challenges that we face. Where in your life are you feeling hopeless? In what ways do you already feel defeated? And how does that affect your actions? The star reversed asks us to nurture our sense of hope and positive energy to help propel our actions with joy instead of fear."
                },
                "love":{
                    "keyword":["self-doubt","loss of faith","hopelessness in love","lack of confidence","extreme self-criticism"],
                    "detail":"Self doubt and a loss of faith is clouding your judgement with the reversed Star’s appearance. Are you suffering from a loss of confidence? Do you pick at your own flaws with excessive harshness? What is making you feel unworthy of love? Others can sense this with you, and this can make you feel even worse while reinforcing your negative feelings about yourself. It is important now to remember all the wonderful things about yourself, so that you can see yourself as a worthy partner.\n\nThe doubt and loss of faith can also apply not just to yourself, but also to your feelings about love in general. If you have been single for a while, cynicism may make you believe that love only creates pain, or is an illusion that is not worth pursuing, when it is actually an attitude problem that pushes others away."
                },
                "career":{
                    "keyword":["lack of motivation","lack of enthusiasm","pessimism about work","feeling defeated","hopelessness in career"],
                    "detail":"With the reversed Star, it may be likely that your negativity is having an effect on your work. You may no longer feel enthusiastic or creative, because you can only see things in a pessimistic manner. Have your hopes not panned out? Have you given up faith that things can get better? When we despair, we make a bad situation worse, and the will to keep going can be snuffed out. It is likely that though things may be tense right now, it isn’t as bad as you seem to make of it. A change in your approach, perspective or attitude may be all that is needed in order to give you motivation to make positive changes."
                },
                "finances":{
                    "keyword":["despair about financial situation","loss of hope for finances","negativity about money","feeling defeated financially"],
                    "detail":"If you have been struggling with finances, the reversed Star can suggest that not all hope is lost, but you may have already given up. There are likely things you can still do now to change your situation, but only if you can muster up the positivity to see things in a new light, and take action. Opening your heart to a more positive outlook can also open your eyes to opportunity."
                },
                "feelings":{
                    "keyword":["disillusionment","disappointment","uncertainty","lack of hope","self-doubt","insecurity","feeling let down"],
                    "detail":"When the reversed Star card appears in relation to how someone feels about you, it suggests a sense of disillusionment or disappointment. This person may feel uncertain and lack hope regarding your connection, possibly due to past experiences that have left them feeling vulnerable or let down. They might be struggling with their own insecurities, which clouds their ability to see the potential for positivity between you.\n\nAs you navigate your feelings, the reversed Star indicates that you could be grappling with self-doubt and a loss of faith in yourself or your situation. You may find it challenging to envision a brighter future or feel disconnected from your aspirations. It’s essential to acknowledge these emotions and seek ways to restore hope within yourself while recognizing that healing is possible through self-reflection and nurturing your inner light."
                },
                "actions":{
                    "keyword":["shift perspective","confront hopelessness","nurture mental health","engage in creativity","seek support"],
                    "detail":"Guided by The Star reversed, you need to shift your perspective and reconnect with your inner self. It may be time to confront feelings of hopelessness or disillusionment, urging you to take action towards healing and renewal. Focus on nurturing your mental well-being by engaging in activities that inspire creativity, such as journaling or painting. Consider setting aside moments for meditation or quiet reflection to regain clarity about your aspirations. Additionally, reach out for support from trusted friends or mentors who can help guide you back toward a more optimistic outlook on life. Embrace this opportunity for personal growth and transformation."
                },
                "yesno":{
                    "keyword":["no"],
                    "detail":"no"
                }
            }
        }
    },
    {
        "title": "The Moon",
        "category": "major arcana",
        "summary":"The moon's light can bring you clarity and understanding and you should allow your intuition to guide you through this darkness.",
        "images": [
            {
                "deck": "Rider-Waite-Smith",
                "url": "https://steve-p.org/cards/pix/RWSa-T-18.png"
            }
        ],
        "meaning": {
            "upright": {
                "general":{
                    "keyword":["illusion","intuition","uncertainty","confusion","complexity","secrets","unconsciousness"],
                    "detail":"On one hand, the Moon card can symbolize your imagination is taking the best of you. In the dark of the night, you are taking a path that you are unsure of, for there could be danger lurking in its depths. You are the crawfish embarking on the path in the card. The moon's light can bring you clarity and understanding and you should allow your intuition to guide you through this darkness.\n\nYou need to be aware of the situations that are causing fear and anxiety in your mind, whether it is now or in the future. It alerts you not to allow inner disturbances and self-deception to take the best of you. These deep memories and fears must be let go, and the negative energies must be released and turned into something constructive.\n\nAnother reading of the Moon card is the existence of illusion. Some hidden truth must be discovered, for what you are seeing now may just be a trick of the light. You must search for the hidden forces that must be unraveled."
                },
                "love":{
                    "keyword":["complicated romance","uncertainty about love","misunderstandings","hidden emotions","self-reflection"],
                    "detail":"With the Moon in a love tarot reading, it’s likely that emotions are complicated at this time. The environment can be one full of misunderstandings, and not everything is as it appears. You may need to do some work to get to the bottom of things; be sure to not only ensure the intentions of others, but also understand your own emotions, desires and motivations. There may be old attitudes, beliefs or ideas that are clouding your judgement. Many things can be hiding in your unconscious affecting your ability to accept love. Are past relationships haunting you? Have you lost faith in love? Do you believe you are unworthy of love? All of these can have profound affects on how we approach relationships. Now is the time to examine them and reveal them as they truly are."
                },
                "career":{
                    "keyword":["uncertainty around career path","confusion at job","lack of information","unclear goals"],
                    "detail":"There may be some uncertainty when it comes to your career path right now. You may not have a clear understanding of what your goals are and which direction you should go towards. Alternatively, your workplace right now can be a tense atmosphere, one that comes from haziness and confusion about project goals, or what everyone should be doing. Misunderstandings can be rife right now, so make sure you express yourself clearly; it may be better to repeat yourself. By the same token, you may find that you don’t have all the information you need right now to make sound work decisions. Who can help shed some light on the facts?"
                },
                "finances":{
                    "keyword":["unclear financial decisions","lacking financial knowledge","confusion around finances","uncertainty about money"],
                    "detail":"Right now may not be the best time to make any big financial decisions, as the Moon signals that the information available to you right now isn’t complete. If you are in the process of taking financial action, don’t be afraid to dig deep and ask questions, so you can make the best decision possible. Confusion and uncertainty around finances may be a problem at the moment."
                },
                "feelings":{
                    "keyword":["confused feelings","uncertainty about emotions","drawn yet fearful","complex emotional landscape","hidden truths"],
                    "detail":"The Moon upright reveals a complex emotional landscape. This person feels confused and uncertain about their feelings for you. They’re drawn to you, yet fears and insecurities cloud their judgment. Their emotions fluctuate, leaving them unsure of how to express what they truly feel, creating an air of mystery around your connection.\n\nThe arrival of The Moon indicates that you're also navigating through a fog of emotions. You may feel intuitive but anxious, sensing deeper truths beneath the surface while wrestling with self-doubt or illusions. Trust your instincts and delve into these feelings; clarity will emerge from the shadows."
                },
                "actions":{
                    "keyword":["embrace uncertainty","trust intuition","self-reflection","journaling","meditation","creative expression","seek guidance"],
                    "detail":"When you draw The Moon, you’re being asked to embrace uncertainty and trust your intuition. This card encourages you to explore the depths of your subconscious, allowing yourself to confront fears or illusions that may be holding you back. In practical terms, take time for self-reflection through journaling or meditation, which can help clarify your thoughts and feelings. Engage in creative activities like painting or writing to express what lies beneath the surface. Additionally, consider seeking guidance from a mentor or therapist who can provide insight into your emotional landscape. Embrace this journey as an opportunity for growth and transformation."
                },
                "yesno":{
                    "keyword":["no"],
                    "detail":"no"
                }
            },
            "reverse": {
                "general":{
                    "keyword":["fear","deception","anxiety","misunderstanding","misinterpretation","clarity","understanding"],
                    "detail":"A Moon reversal in a reading can sometimes indicate that the darker and more negative aspects of the moon are present in your life. It could represent confusion and unhappiness - you want to make progress, but you are not sure what is the right thing to do. You must deal with your anxiety and fears by overcoming them, for they are like shadows in the dark. It is time to believe in yourself and move forward.\n\nThe moon reversal meaning indicates that you are in an intuitive period or you have recently battled confusion, anxiety, and self-deception. It could be that you are misinterpreting how you have been feeling however you are starting to improve on this.\n\nAnother reversed moon meaning is that the forces of the night that are bringing you confusion are starting to dissipate. You have started managing your fears and anxiety. Whatever negative energies you have been facing are slowly fading away. It presents a liberating experience as you discover the positive side of things."
                },
                "love":{
                    "keyword":["deception","fear","paranoia","confusion in love","lack of clarity","misinterpretation","emotional insecurity"],
                    "detail":"The reversed Moon tarot love meaning can suggest that confusion and deception may be in the air. You may not have all the information you need at this moment, and you’ll have to rely on intuition in order to guide your way to the truth. Are you being honest with your partner? Are they being honest with you? Sometimes deception doesn’t necessarily have to have malicious motivations, but can even be done out of kindness or the desire to spare another person’s feelings. Hiding the truth however, is never a sustainable situation."
                },
                "career":{
                    "keyword":["clarity at work","overcoming anxiety","understanding workplace dynamics","avoiding deception"],
                    "detail":"On one hand, the reversed Moon can signal the dissipation of the uncertainty and confusion that has characterized your job or workplace. Things may be more clear, and you may have a better understanding of which direction you should be working towards. Alternatively, the reversed Moon can also indicate a worsening of the situation, where misunderstandings and poor communication can even turn into deception, lying and sabotage. Your anxieties and fear about the workplace or your colleagues can make your worst fears come true, as everyone becomes more defensive, protective and paranoid."
                },
                "finances":{
                    "keyword":["clarity in finances","deception regarding finances","confusion around financial decisions","anxiety about money"],
                    "detail":"In the best cases, the reversed Moon can signal finding clarity about your financial situation and your financial goals. You are getting all the information you need to feel comfortable about a big decision or an investment in your future. At worst however, the reversed Moon can also suggest that there may be deception regarding your finances. Listen to your instincts; but try and separate your fears from intuition."
                },
                "feelings":{
                    "keyword":["confusion","anxiety","self-doubt","fear of commitment","misinterpretation","lack of clarity"],
                    "detail":"The arrival of the reversed The Moon suggests a cloud of confusion and uncertainty surrounding how someone feels about you. They may be grappling with self-doubt or fear, leading them to question their feelings for you. This card suggests that they are struggling to see things clearly, possibly feeling overwhelmed by illusions or misinterpretations of your relationship.\n\nIn terms of your own feelings, the reversed The Moon indicates that you might be experiencing anxiety or insecurity regarding this connection. You could feel a lack of clarity about what you truly want or need from this person, prompting introspection and a desire to confront any fears holding you back from deeper emotional engagement. Embrace this opportunity for self-discovery as it can lead to greater understanding and resolution within yourself."
                },
                "actions":{
                    "keyword":["confront fears","seek clarity","engage in honest conversations","practice meditation","embrace vulnerability"],
                    "detail":"The arrival of The Moon reversed suggests that now is the time to confront your fears and illusions. You may be feeling lost or uncertain, but this card urges you to seek clarity. Start by journaling your thoughts and feelings; writing can help illuminate what’s hidden in your subconscious. Engage in honest conversations with trusted friends or mentors who can provide perspective. Additionally, consider grounding practices like meditation or nature walks to reconnect with reality and dispel confusion. Embrace vulnerability by facing what scares you instead of avoiding it; this will lead to personal growth and a clearer path forward."
                },
                "yesno":{
                    "keyword":["no"],
                    "detail":"no"
                }
            }
        }
    },
    {
        "title": "The Sun",
        "category": "major arcana",
        "summary":"The card shows that you have a significant sense of deserved confidence right now.",
        "images": [
            {
                "deck": "Rider-Waite-Smith",
                "url": "https://steve-p.org/cards/pix/RWSa-T-19.png"
            }
        ],
        "meaning": {
            "upright": {
                "general":{
                    "keyword":["happiness","success","optimism","vitality","joy","confidence","truth","abundance","fulfillment"],
                    "detail":"The Sun card represents success, abundance, and radiance. Like the sun itself, it gives strength and vitality to all those that are lucky enough to feel its rays. There is much joy and happiness that is coming to you.\n\nBecause of your own personal fulfillment, you provide others with inspiration and joy as well. People are drawn to you because they are capable of seeing the warm and beautiful energy which you bring into their lives. You are also in a position in which you are capable of sharing your qualities as well as achievements with other people. You radiate love and affection towards those you care about the most.\n\nThe card shows that you have a significant sense of deserved confidence right now. Life is currently particularly good, and the sun is shining your way as you reach the goals that you set. The Sun is one of the cards in the tarot which provide nothing but good feelings and fulfillment."
                },
                "love":{
                    "keyword":["happiness in relationship","celebration","fulfillment","harmony","positivity","radiance","connection"],
                    "detail":"With the Sun comes light, life and warmth. The Sun tarot love meaning heralds much of the same in your relationship and your romantic life in general. There is happiness, celebration, and fulfillment in this card. Your relationship can be blossoming under this light, bringing the two of you closer together as you enjoy life’s blessings. There is likely harmony now, and you can use this time to create an even closer connection with your loved one. Should you be single, now is also the time to step out and let yourself shine. Your positivity and radiance can be magnetic now, and draw you the kind of romance that you’ve dreamed of."
                },
                "career":{
                    "keyword":["enthusiastic at work","motivation","successful projects","positive work environment","career fulfillment"],
                    "detail":"When it comes to your career, the Sun brings success, optimism and joy wherever it shines. You may be experiencing a period of great enthusiasm, motivation and happiness when it comes to your job right now. Your career may feel both spiritually and materially fulfilling. This happiness and positivity can be radiant now; your happiness may create a wonderful environment for your colleagues and those you surround yourself with. If you’re going through the process of searching for a new job or a promotion, your continued positivity will bring you success in your career goals."
                },
                "finances":{
                    "keyword":["strong financial situation","comfortable finances","abundance","gratitude","rewarding financial outlook"],
                    "detail":"Your financial situation may be comfortable and rewarding right now. The Sun suggests a level of gratitude, abundance and happiness, and this is no different within the context of a financial tarot reading. The sun also shines light on things, making them visible and out in the open. If there have been any hidden factors related to your finances, they can be revealed now."
                },
                "feelings":{
                    "keyword":["happiness","joy","optimism","admiration","inspiration","warmth","confidence","fulfillment"],
                    "detail":"The Sun upright reveals a radiant warmth in how someone feels about you. They see you as a source of joy and inspiration, uplifted by your presence. Your energy draws them in, and they appreciate the light you bring into their life. Their emotions are filled with optimism and admiration; they genuinely enjoy being around you.\n\nAs for your own feelings, The Sun signifies clarity and happiness within yourself. You may be experiencing an awakening or newfound confidence that empowers you to embrace life fully. This card invites you to celebrate your achievements and recognize the abundance around you, nurturing a deep sense of fulfillment and contentment in your emotional landscape."
                },
                "actions":{
                    "keyword":["embrace positivity","pursue joy","engage in creativity","foster uplifting connections","practice gratitude"],
                    "detail":"With The Sun, you’re being asked to embrace positivity and clarity in your actions. Now is the time to pursue what brings you joy and fulfillment, allowing your inner light to shine brightly. Focus on activities that inspire creativity, such as starting a new project or engaging in hobbies that excite you. Seek out uplifting experiences with friends or family, fostering connections that energize you. This card encourages you to adopt an optimistic mindset; practice gratitude daily by acknowledging the good around you. By radiating positivity and taking joyful action, you'll attract even more abundance into your life."
                },
                "yesno":{
                    "keyword":["yes"],
                    "detail":"yes"
                }
            },
            "reverse": {
                "general":{
                    "keyword":["blocked joy","pessimism","unrealistic expectations","lack of confidence","taking things for granted"],
                    "detail":"In the reversed position, the Sun indicates that you might have significant difficulties finding positive aspects to certain situations. The clouds might be blocking out the warmth and light that you need to progress. This might be preventing you from feeling confident and powerful. You may experience certain setbacks which are damaging your optimism and enthusiasm.\n\nOn the other hand, the Sun reversed might be indicative that you are being unrealistic. It might be a sign that you have an overly optimistic perception of certain situations. These are things that you need to take into account in order to ensure that you are on the right track and your successes continue as they do."
                },
                "love":{
                    "keyword":["boredom","taking love for granted","unable to see happiness in relationship","lack of quality time"],
                    "detail":"The Sun still shines, though it may be temporarily blocked out by the clouds right now. If you’re in a relationship, you may be feeling bored, even though everything is going swimmingly. Are you taking your relationship for granted? Have you and your partner drifted apart due to daily routines and mundane tasks? It’s likely that the two of you need a little more quality time together to rekindle your romance. The Sun is always a positive card, whether upright or reversed; but reversed it usually means that something prevents you from seeing the wonderful things that you already have. What about your partner did you fall in love with? What can you be thankful for in your relationship?"
                },
                "career":{
                    "keyword":["unhappiness","pessimism","unrealistic expectations","overconfidence","failure to appreciate job"],
                    "detail":"Even when the Sun is reversed, it suggests pleasant things; but perhaps clouded by one’s inability to appreciate and see what is truly there. If you’ve been glum, depressed or pessimistic about what you have at work, the Sun suggests that you need only to peel back the clouds and see what happiness you already have. Feeling drained and exhausted? Your work environment may be very supportive of you getting the rest you need. Perhaps you feel you aren’t being paid enough? Bringing superiors to attention in this matter can get you the raise you deserve. Don’t let your negativity close doors to you taking decisive action and improving the situation. Sometimes, this card can also suggest over-confidence, or unrealistic expectations when it comes to your ambitions. Make sure that you are practical about what you can achieve at this time."
                },
                "finances":{
                    "keyword":["overly optimistic about finances","unrealistic expectations","temporary hardships","financial confusion"],
                    "detail":"Reversed, the Sun can suggest that your worries about your financial matters may be short-lived, and perhaps less serious than you imagined they would be. Alternatively, take care that the decisions that you’re making now regarding your finances are well-researched and founded in sound logic. The reversed Sun can signal being overly optimistic and unrealistic. Temper your expectations, but remain hopeful."
                },
                "feelings":{
                    "keyword":["confusion","disappointment","lack of clarity","overshadowed by doubts","struggling with self-doubt"],
                    "detail":"The arrival of the reversed Sun suggests that the person in question feels a sense of confusion or disappointment regarding their emotions towards you. They may be struggling to see the bright side of your connection, feeling overshadowed by doubts or past experiences that cloud their judgment. Their feelings might reflect a lack of clarity and joy, leaving them uncertain about how to move forward.\n\nIn terms of your own feelings, this card indicates that you could be grappling with self-doubt or insecurity. You might feel as though your inner light is dimmed, leading to moments where optimism seems out of reach. It’s essential to acknowledge these feelings and seek ways to reignite your passion for life and relationships, allowing yourself the space to rediscover what brings you true happiness."
                },
                "actions":{
                    "keyword":["introspection","assess joy","reconnect with passions","take a break from social media","nurture self-love"],
                    "detail":"When you draw The Sun reversed, it’s a powerful reminder to realign your focus inward. This is a time for introspection, where you should assess what truly brings you joy and fulfillment. Consider taking a break from social media or activities that drain your energy, allowing yourself space to reconnect with your passions. Engage in journaling or meditation to uncover any hidden fears or doubts that might be clouding your happiness. Embrace the opportunity to nurture self-love and authenticity, as this will illuminate the path toward genuine contentment in both personal and professional realms."
                },
                "yesno":{
                    "keyword":["no"],
                    "detail":"not right now"
                }
            }
        }
    },
    {
        "title": "Judgement",
        "category": "major arcana",
        "summary": "To see this card can also indicate that you are in a period of awakening, brought on by the act of self-reflection.",
        "images": [
            {
                "deck": "Rider-Waite-Smith",
                "url": "https://steve-p.org/cards/pix/RWSa-T-20.png"
            }
        ],
        "meaning": {
            "upright": {
                "general":{
                    "keyword":["self-evaluation","awakening","renewal","purpose","reflection","reckoning","personal growth"],
                    "detail":"The traditional Judgement meaning focuses on the moment when we reflect and evaluate ourselves and our actions. It is through self-reflection that we can have a clearer and objective understanding about where we are now, and what we need to do in order to grow as humans. The Judgement card appearing in a reading signifies that you are coming close to this significant point in your life where you must start to evaluate yourself.\n\nTo see this card can also indicate that you are in a period of awakening, brought on by the act of self-reflection. You now have a clearer idea of what you need to change and how you need to be true yourself and your needs. This can mean making small changes to your daily life or making huge changes that not only affect you but the people close to you.\n\nThe Judgement card reminds us that we all will be faced with choices that will have an astounding effect for your entire life. The card brings to mind moments where actions you have taken have changed the course of your path for good. There may have been a moment where there is no looking back. The consequences of those actions eventually will catch up to you, and this card seems to indicate that this is the time. You may have to let go of the past, so you can move forward with your plans to have a new life."
                },
                "love":{
                    "keyword":["renewal of love","self-reflection","making adjustments in relationship","open communication","addressing past issues"],
                    "detail":"Now is the time to take a closer look at your love life and figure out what needs to be changed. The Judgement tarot love meaning indicates a time of self-reflection and analysis initiated by an awakening. Issues in your love life that you once ignored may be seen clearly now, and you have the chance to make adjustments. Keep communication with your partner open, and make sure both of you are aware of each other’s needs. Small changes that the two of you make together can have a great effect on your relationship. Your past actions and their consequences, whether good or bad, are catching up with you now. If you’ve made mistakes in the past, use the lessons you’ve learned to make changes for your future."
                },
                "career":{
                    "keyword":["finding career purpose","accountability at work","self-reflection","awakening","making adjustments"],
                    "detail":"You may be going through a period of awakening when it comes to your career path. Perhaps you have found a new purpose or a calling that cannot be ignored. This can sometimes come with adjustments needing to be made at your workplace or your position. While this can be stressful, these changes can bring you a sense of feeling revitalized when it comes to your work. If your workplace has been tense, the Judgement card also signals that you may need to be more aware about how your actions at your workplace are affecting others. Take some time to evaluate how your behavior has been, and what can be improved. Take responsibility for your actions and your part in any conflicts that have been brewing."
                },
                "finances":{
                    "keyword":["self-reflection","evaluating financial habits","making changes","discovering values","improving material situation"],
                    "detail":"You may have to go through a period of self-reflection when it comes to your relationship with money. Sometimes this means evaluating whether your financial habits have been hindering your material situation, as well as making the changes necessary to do better. Are you someone that consistently purchases things they can’t afford? Or do you always feel lacking, even as your financial situation improves? New ways of thinking about your resources can come now, that give you the chance to make positive improvements."
                },
                "feelings":{
                    "keyword":["self-evaluation","awakening","renewal","reflection","clarity","transformative feelings","potential for growth"],
                    "detail":"The upright Judgement card reveals a profound awakening within them. They’re reflecting on past experiences with you, weighing your actions and intentions as they seek clarity. This person feels compelled to evaluate the relationship deeply, recognizing its potential alongside any unresolved issues. Their feelings are transformative; they see the possibility for growth and renewal if both of you embrace honesty and accountability.\n\nFor you, Judgement signals a call to self-reflection. You may feel an urge to confront your truths, acknowledging what has held you back or caused inner conflict. This card urges you to embrace change and take responsibility for your emotions while seeking a deeper understanding of yourself in relation to this connection."
                },
                "actions":{
                    "keyword":["self-evaluation","embrace change","reflect on past choices","seek feedback","let go of old habits"],
                    "detail":"The upright Judgment card reflects a transformative phase in your life. It urges you to reflect on past choices and consider how they shape your present. Now is the time for self-evaluation; take stock of what truly matters to you. Engage in activities that promote personal growth, such as journaling or meditating on your goals and values. Seek feedback from trusted friends or mentors who can offer fresh perspectives. This is also an ideal moment to let go of old habits that no longer serve you, allowing space for new opportunities and insights to emerge in your journey forward."
                },
                "yesno":{
                    "keyword":["Yes"],
                    "detail":"Yes"
                }
            },
            "reverse": {
                "general":{
                    "keyword":["self-doubt","lack of self-awareness","missed opportunities","harsh self- judgment","inability to learn lessons"],
                    "detail":"The reversed Judgement card can mean that you doubt and judge yourself too harshly. This could be causing you to miss opportunities that were awaiting you. The lost momentum causes you to fall behind in your plans, which can make it difficult to move forward. This means that you should not be cautious, but you should be moving forward with pride and confidence.\n\nAnother reading of the Judgement reversal card can be a push to take time out of your busy routine to reflect upon your life to this point, and what you have learned so far. You are most likely not giving yourself the time or space to fully think about the matter and learn the lessons you need to to be able to progress with awareness. You could also be too critical of your past actions, so you are not giving yourself the forgiveness to move forward. The mistakes that we have made in the past are learning tools, so they help us move though life. Focusing too hard on these mistakes can cause us to trip and fall."
                },
                "love":{
                    "keyword":["self-doubt","blaming partner","denial about love life","lack of awareness","need for compromise"],
                    "detail":"Ensure that your criticisms about your partner right now are fair before you make them. There is likely something that you are unhappy about, but the reversed Judgement tarot love meaning can signal that some compromise and moderation is needed.\n\nOn the other hand, this card can also signal that you need to open your eyes to your romantic situation and see it more clearly. Have you been in denial about something? Are you happy in your relationship? Is there something missing? Are there attitudes you have to love that you have been blind to but are deeply affecting your approach to dating? This card is asking you to see yourself and your relationships with honesty. Facing the truth can also free you."
                },
                "career":{
                    "keyword":["self-doubt","lack of self-awareness","failure to learn lessons","inability to take responsibility"],
                    "detail":"Perhaps you have been too harsh on yourself lately. If you’ve made mistakes at work, you may find that it is hard to let those feelings of disappointment with yourself go, instead of making amends and moving on. You may be left with a lingering sense of doubt about your own abilities. Alternatively, this card can signal that you are unable to take responsibility for your own actions, and not learning the lessons you need to in order to take the next steps in your career. Your lack of awareness when it comes to handling yourself may be grating on colleagues. Have you been doing all that you can when it comes to your work projects? Have you communicated well? Or do you always shift the blame to others?"
                },
                "finances":{
                    "keyword":["self-doubt","failure to learn financial lessons","harsh self-criticism","repeating past mistakes"],
                    "detail":"If you’ve gone through a financial setback lately, you may be rather harsh on yourself right now. It is important to learn your lessons when it comes to making responsible choices, but it is also helpful for you to be kind to yourself, so that you can remain motivated. On the other hand, the reversed Judgement card suggests that you may find yourself falling into the same patterns when it comes to financial decisions. Be aware of which side of the spectrum you’re falling on."
                },
                "feelings":{
                    "keyword":["confused feelings","self-doubt","uncertainty","struggling with past issues","hesitant to embrace feelings"],
                    "detail":"The arrival of the reversed Judgement card suggests that this person is grappling with confusion and self-doubt. They may feel uncertain about their emotions, struggling to make sense of their feelings toward you. This indecision can stem from past experiences or unresolved issues that cloud their judgment, leaving them hesitant to fully embrace what they might truly feel.\n\nIn terms of your own feelings, the reversed Judgement indicates a time of introspection where you might be questioning your choices and direction. You could be feeling disconnected from your true self or unsure if you're on the right path emotionally. It’s essential to take this opportunity for reflection; consider what changes need to be made within yourself before seeking clarity in external relationships."
                },
                "actions":{
                    "keyword":["self-reflection","embrace self-forgiveness","set new goals","seek feedback","let go of past judgments"],
                    "detail":"The arrival of the reversed Judgement card suggests that now is a time for introspection and reevaluation of your life choices. You may need to let go of past judgments or criticisms, both from yourself and others. This is an opportunity to embrace self-forgiveness and release any guilt holding you back. Consider taking actions like journaling your thoughts, meditating on what truly matters to you, or seeking feedback from trusted friends about your current path. Focus on personal growth by setting new goals aligned with your values, allowing yourself the grace to redefine success in a way that feels authentic and fulfilling."
                },
                "yesno":{
                    "keyword":["no"],
                    "detail":"not yet"
                }
            }
        }
    },
    {
        "title": "the world",
        "category": "major arcana",
        "summary":"To encounter the World in your cards is to encounter a great unity and wholeness.",
        "images": [
            {
                "deck": "Rider-Waite-Smith",
                "url": "https://steve-p.org/cards/pix/RWSa-T-21.png"
            }
        ],
        "meaning": {
            "upright": {
                "general":{
                    "keyword":["completion","achievement","fulfilment","sense of belonging","wholeness","harmony","unity"],
                    "detail":"To encounter the World in your cards is to encounter a great unity and wholeness. It symbolizes the moment when the inner and the outer worlds - self and other - become a single entity. In some traditions, this state is described as enlightenment, or nirvana. There is a recognition that the individual self is profoundly linked with all other things, and that we all dance and sway along the flow of life to one rhythm. Not only do you hear this rhythm, but you participate in it - following the dips and the rises, the joys and the sorrows.\n\nThe meaning of the World card is fulfillment, achievement, and completion. This shows that all the efforts that you have been putting in place are starting to pay off. It reflects that you have completed a major milestone in your life and you have built the resilience to withstand challenges. The World may indicate completion of a long-term project, study or any other major event in your life. It may also mean the birth of a child, marriage, graduation or any other thing that you have accomplished.\n\nThe World card shows that you have a desire to give back to the community in various ways. You have a commitment to make the world a better place because you understand that everything is connected."
                },
                "love":{
                    "keyword":["deep fulfillment","gratitude","sense of completion","happiness in relationship","moving to next step"],
                    "detail":"Your relationship gives you a sense of deep fulfillment and gratitude right now. The World tarot love meaning signals a feeling of completion and happiness. At times, this card can even suggest moving to the next step of your relationship, such as marriage or starting a family. As you complete one cycle in your life, you are also looking towards the future into next steps. You and your partner may be making plans, perhaps even big decisions.\n\nEven when single, there is a sense of fulfillment and happiness here. Before getting into a relationship, one must feel like a whole person. While a relationship may be nice, you are confident on your own. You have this sense of wholeness and self understanding right now, giving you great opportunities to meet new and exciting people, as well as charm and magnetism."
                },
                "career":{
                    "keyword":["career fulfillment","achieving goals","job satisfaction","completing projects","celebrating success"],
                    "detail":"Be proud of yourself, as you have done what you have set out to do when it comes to your career. Whether that means finding a job that makes you feel fulfilled both spiritually and materially, finishing a particularly challenging project, or opening your own business, there’s much to celebrate right now. Take the time now to enjoy what you have earned. It’s likely you’re already thinking about what comes next, as this is the normal cycle of things. For now, enjoy the moment."
                },
                "finances":{
                    "keyword":["financial achievement","reaching financial goals","enjoying fruits of labor","financial security","long-term planning"],
                    "detail":"You may have worked hard in order to reach your financial goals, and now may be the time to enjoy the fruits of your labor. Perhaps you’ve paid off some debt, found security after saving, or made a large purchase that you’ve saved up for. Give yourself a pat on the back and be proud of what you’ve accomplished. Now can be the time of thinking about other long term goals. Since the World also represents a feeling of wholeness, take some time to understand how your finances fit into the bigger picture of your life."
                },
                "feelings":{
                    "keyword":["deep fulfillment","emotional connection","sense of wholeness","joy in relationship","gratitude for you"],
                    "detail":"The World signifies a profound sense of completion and emotional fulfillment. This person views you as an essential part of their journey, believing that your connection brings them joy and wholeness. They cherish the harmony between you, recognizing the potential for growth and shared experiences that enrich both your lives.\n\nOn a personal level, The World indicates that you're feeling deeply satisfied and accomplished. You may sense alignment with your purpose, ready to embrace new opportunities. Celebrate where you are now while staying open to what lies ahead; this card inspires an optimistic outlook on personal growth and relationships."
                },
                "actions":{
                    "keyword":["celebrate achievements","set new goals","explore creative outlets","engage in community service","mentor others"],
                    "detail":"Drawing The World opens a space for you to embrace a holistic view of your life and take actions that promote completion and fulfillment. This is a time to celebrate your achievements while also recognizing the interconnectedness of all aspects of your existence. Consider setting new goals that align with your passions, perhaps by exploring creative outlets or engaging in activities that expand your horizons, such as travel or learning a new skill. Reflect on how far you've come and share this journey with others; mentoring someone can deepen both their understanding and yours. Embrace wholeness in every action you take now."
                },
                "yesno":{
                    "keyword":["yes"],
                    "detail":"yes"
                }
            },
            "reverse": {
                "general":{
                    "keyword":["lack of closure","feeling incomplete","emptiness","disconnection","unfulfilled potential","dissatisfaction"],
                    "detail":"You are drawing near to something that marks the end of a journey or an era. You may have many accomplishments that have lined your path, but there is a strange emptiness that fills you when you look backwards upon it, as if you have all the pieces but they are not coming together. What is missing? Do you feel connected to what you're doing? Do you feel connected to others? What alienates you from feeling complete? From feeling whole?"
                },
                "love":{
                    "keyword":["missing something in love life","feeling disconnected from partner","lack of closure in relationships"],
                    "detail":"While other aspects of your life may be going well, it seems like when it comes to love, something is missing. The reversed World tarot love meaning signals a feeling of incompletion; a nearing to the end of one cycle, but not quite there. You are so close to feeling fulfilled and happy, but something prevents you from seeing it. Are you not seeing your partner for all the wonderful things they are? Or is a past relationship coloring your experience of this one? Do you not have a feeling of closure from a past partner? Something requires you to tie up loose ends right now, so that you can be happy in the moment."
                },
                "career":{
                    "keyword":["lack of closure","feeling incomplete","false measure of success","reevaluating goals","missing piece in career"],
                    "detail":"Have you finally accomplished a big career goal that you wanted for a long time, only to find that the rewards aren’t quite as sweet as you thought they were? Or have you fallen just shy of what you wanted to accomplish? The reversed World signals nearing completion, but perhaps missing the final pieces that would make you truly feel fulfilled. Perhaps your goals have been too defined by what others perceive as success, or perhaps you have set your bar too low that reaching this goal felt unchallenging. Now is the time to reevaluate your goals and make the adjustments as necessary."
                },
                "finances":{
                    "keyword":["stagnation","feeling unfulfilled","nearing financial goals","lack of satisfaction","reevaluation needed"],
                    "detail":"Even if you’re in a financially comfortable position, you may feel stagnant and unhappy with what you have. There is likely a reevaluation of your relationship to the material things that needs to be adjusted with the reversed World. If you’ve found that you’ve fallen short of your financial goals, now is not the time to indulge in feelings of disappointment; you are close to what you’d like to achieve; remain consistent and you’ll find comfort."
                },
                "feelings":{
                    "keyword":["incomplete","disconnected","unfulfilled","restless","uncertain","lacking closure","questioning feelings"],
                    "detail":"The appearance of the reversed The World card in relation to how someone feels about you suggests a sense of incompleteness or disconnection. This person may feel uncertain or unfulfilled in their emotions towards you, as if they are struggling to see the bigger picture of your relationship. They might be grappling with feelings of inadequacy or fear that things will not progress as they hope.\n\nIn terms of your own feelings, this card reflects a similar theme of restlessness and dissatisfaction. You may find yourself questioning your place in this situation, feeling like something is missing or unresolved. It encourages you to explore these emotions deeply and consider what truly brings you fulfillment, urging both introspection and clarity on what steps to take next for personal growth and connection."
                },
                "actions":{
                    "keyword":["reassess goals","prioritize self-reflection","engage in personal growth activities","redefine success on your terms"],
                    "detail":"When you draw The World reversed, it signals a time of introspection and reassessment. It’s time to reassess your goals and the direction of your life. Focus on what truly matters to you, rather than external expectations. Take a step back from overwhelming commitments and prioritize self-reflection. Engage in activities that foster personal growth, such as journaling or exploring new hobbies that ignite your passion. Consider reaching out to mentors or supportive friends who can provide guidance and perspective. Embrace this opportunity for introspection, allowing yourself to redefine success on your own terms before moving forward confidently."
                },
                "yesno":{
                    "keyword":["no"],
                    "detail":"no"
                }
            }
        }
    }
]
